[
    {
        "input": {
            "skill": [
                "UI/UX",
                "User Research",
                "Figma",
                "Adobe XD",
                "Color Theory"
            ],
            "category": [
                "Design & Creative"
            ],
            "top_n": 10
        },
        "recommendations": [
            {
                "Category": "Computer Science",
                "Description": "No Description",
                "Duration": "3 - 6 Months",
                "Enrolled": 0,
                "Institution": "Packt",
                "Level": "Intermediate",
                "Modules Description": [
                    "In this module, we will build a strong foundation in visual design by exploring its core elements and principles. You will delve into fundamental concepts like line, shape, color, and texture, and learn how they interact to create aesthetically pleasing and functional designs. By mastering these basics, you will be prepared to craft designs that are both impactful and harmonious.",
                    "In this module, we will uncover the critical role feedback plays in shaping exceptional UX designs. You will learn to navigate the complexities of handling feedback by exploring how to request constructive input, embrace a growth-oriented mindset, and transform critiques into actionable improvements. This section equips you with the tools to foster productive dialogue and evolve as a designer.",
                    "In this module, we will explore real-world scenarios to better understand how to receive and respond to different kinds of UX feedback. Through examples, you will learn how to handle constructive criticism, manage unhelpful or prescriptive comments, and maintain a professional demeanor in all situations. This practical approach will strengthen your ability to turn feedback into opportunities for growth.",
                    "In this module, we will explore essential sites and tools for collecting design inspiration that fuel creativity and innovation. You'll learn how to strategically source ideas, compare platforms, and create an organized repository for your design projects.",
                    "In this module, we will delve into the fundamentals of wireframing, including its purpose, benefits, and practical applications. Through a mix of demonstrations and hands-on activities, you'll learn to create wireframes on paper and with tools like Balsamiq and Adobe XD. By the end, you'll understand the strengths and limitations of each approach and be equipped to share and refine your wireframes effectively.",
                    "In this module, we will practice sketching by tackling real-world design problems and proposing creative solutions. You'll develop your ability to visually translate concepts into sketches, ensuring clarity and effectiveness in presenting your ideas.",
                    "In this module, we will apply wireframing techniques to address specific design challenges. You'll practice building wireframes as a problem-solving tool, focusing on clarity, functionality, and user-centric solutions.",
                    "In this module, we will uncover the art and science of typography, from foundational principles to advanced applications. You'll learn essential terminology, explore the differences between print and digital typography, and discover how to select and combine typefaces effectively. Through hands-on exercises, you'll master typographic hierarchy, responsive design, and variable fonts, ensuring your typography elevates both form and function in your designs.",
                    "In this module, we will analyze and transform typographic designs, comparing their \"before\" and \"after\" states. By revisiting initial layouts and refining them with advanced typographic techniques, you'll gain a deeper understanding of how thoughtful typography enhances both aesthetics and user experience.",
                    "In this module, we will focus on designing cohesive and functional layouts by integrating multiple design elements. You'll learn to refine text content, structure visual hierarchy, align elements using grids, and select colors that enhance usability and accessibility. By mastering these techniques, you'll create layouts that are both visually appealing and user-friendly.",
                    "In this module, we will explore the essentials of creating mockups, from understanding their purpose to preparing and building them. You'll learn step-by-step techniques to create professional mockups, streamline your process, and effectively communicate your designs to stakeholders.",
                    "In this module, we will evaluate and refine color palettes by comparing their \"before\" and \"after\" states. You'll learn how to address common color-related issues and implement changes that improve the overall aesthetic and functionality of your designs.",
                    "In this module, we will examine and transform layouts, focusing on the improvements made between \"before\" and \"after\" iterations. You'll gain insight into how adjustments to structure and design elements can significantly enhance the effectiveness and aesthetics of a layout.",
                    "In this module, we will dive into prototyping with Adobe XD, covering everything from basic tools to advanced interactive features. You'll learn to create artboards, add shapes, images, and text, and build functional prototypes with interactivity. By the end, you'll be equipped to design and share professional prototypes that bring your ideas to life.",
                    "In this module, we will explore prototyping with Figma, from project setup to creating interactive designs. You'll learn how to arrange elements, draw shapes and curved lines, and build reusable components. By the end, you'll be equipped to design complete interfaces and share interactive prototypes seamlessly.",
                    "In this module, we will apply prototyping skills to solve real-world design challenges. You'll work through the process of creating and refining an interactive prototype, focusing on effectively translating ideas into functional solutions.",
                    "In this module, we will focus on fostering productive collaboration with developers throughout the design process. You'll learn strategies for clear communication, bridging the gap between design and development, and ensuring a seamless final handoff of your designs for implementation.",
                    "In this module, we will focus on presenting design ideas effectively, from understanding your audience to structuring a compelling narrative. You'll learn how to set clear goals, communicate your problem-solving approach, and outline actionable next steps, ensuring your designs resonate and gain stakeholder buy-in."
                ],
                "Modules Duration": [
                    "39 minutes",
                    "56 minutes",
                    "36 minutes",
                    "33 minutes",
                    "2 hours",
                    "37 minutes",
                    "41 minutes",
                    "2 hours",
                    "36 minutes",
                    "1 hour",
                    "1 hour",
                    "37 minutes",
                    "35 minutes",
                    "1 hour",
                    "1 hour",
                    "37 minutes",
                    "43 minutes",
                    "1 hour"
                ],
                "Modules Name": [
                    "Visual Design Foundations",
                    "Handling Feedback as a UX Designer",
                    "Receiving UX Feedback by Example",
                    "Collecting Design Inspiration",
                    "Introduction to Wireframing",
                    "Practice Sketching",
                    "Practice Wireframing",
                    "Typography for Designers",
                    "Before and After: Typography",
                    "Designing Layouts",
                    "Creating Mockups",
                    "Before and After: Color",
                    "Before and After: Layout",
                    "Prototyping with Adobe XD",
                    "Prototyping with Figma",
                    "Practice Prototyping",
                    "Collaborating with Developers",
                    "Presenting Design Ideas"
                ],
                "Rating": "No rating",
                "Similarity": 0.6450671553611755,
                "Skills": "Prototyping, Design Elements And Principles, User Centered Design, Storytelling, Style Guides, Design Reviews, Interactive Design, User Experience Design, Oral Expression, Color Theory, Typography, Adobe XD, Digital Design, Graphic and Visual Design, Human Centered Design, Wireframing, Figma (Design Software)",
                "Subcategory": "Design and Product",
                "Title": "UX: Visual Design Process",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "No Description",
                "Duration": "1 - 3 Months",
                "Enrolled": 0,
                "Institution": "Northeastern University",
                "Level": "Beginner",
                "Modules Description": [
                    "In this comprehensive module, students will explore the essential principles that highlight the importance of User Experience (UX). Through dynamic discussions and practical examples, participants will not only understand the core of UX but also learn to express its critical role in developing innovative designs. This module goes beyond theoretical knowledge, enabling students to apply key UX principles, such as Miller's Law, Jakob's Law, Von Restorff Effect, and more. By the conclusion of this module, students will have a solid understanding of UX's theoretical underpinnings within the digital environment.",
                    "In this module, you'll learn how to align product objectives with user needs, creating not just effective but enjoyable experiences. We'll dive into the art of visual design, examining various logo types, from the simple beauty of Letter Marks to the detailed complexity of Combination Marks, enhancing your understanding of brand identity. Additionally, you'll gain skills in developing comprehensive use cases, which include both broad overviews and in-depth analyses, to fully grasp user interactions. By the end of this module, you'll become adept in logo design nuances and skilled in crafting user-focused use cases.",
                    "In this module, you will begin a comprehensive exploration to master the art and science of user research. You will learn to distinguish between qualitative and quantitative research techniques through an in-depth examination of methodological nuances, equipping yourself with a broad range of tools to uncover valuable insights. You will learn how to become proficient in conducting user interviews and designing questions that reveal user needs, motivations, and pain points. Additionally, you will explore the strategic process of persona differentiation, learning how to create vivid user personas that enhance the design process. As a concluding highlight, the module clarifies the challenge of shopping cart abandonment, providing practical strategies to minimize it when developing engaging apps and websites.",
                    "In this module, you will navigate the foundational elements of UX design, focusing on the art of defining the project scope to ensure a clear vision and purpose. You will explore the Scope Plane, a fundamental aspect of the UX design process, which offers a structured method to clarify and refine project goals. This module teaches you how to transform those ideas into low-fidelity blueprints. Through interactive activities and guided lab sessions, you will become proficient in creating clear, functional wireframes with industry-standard tools like Balsamiq. You'll engage in the process of sketching, iterating, and testing your wireframes, thereby gaining valuable hands-on experience. By the end of this module, participants will not only possess the skills to effectively define project scopes but will also be prepared to turn their design concepts into reality with precision and clarity.",
                    ""
                ],
                "Modules Duration": [
                    "4 hours",
                    "4 hours",
                    "2 hours",
                    "5 hours",
                    "2 minutes"
                ],
                "Modules Name": [
                    "Introduction to User Experience (UX)",
                    "Unlocking UX: Strategy, Use Cases, Logo Design",
                    "Introduction to User Research",
                    "Scoping and Balsamiq: Intro to Wireframing",
                    "Conclusion"
                ],
                "Rating": "No rating",
                "Similarity": 0.623015284538269,
                "Skills": "User Research, Graphic and Visual Design, User Story, UI/UX Research, Prototyping, Usability, User Experience Design, Persona Development, Wireframing, User Centered Design, Experience Design, Logo Design",
                "Subcategory": "Design and Product",
                "Title": "UX Web Design: Build User-Centric Websites",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of User Interface Design Specialization",
                "Duration": "1 - 3 Months",
                "Enrolled": 27990,
                "Institution": "University of Minnesota",
                "Level": "Mixed",
                "Modules Description": [
                    "Note that weeks 1 and 2 form a cohesive whole, with more lecture content in week 1, and more practice (assignment and quizzing) in week 2.",
                    "The 3rd and 4th week of the course are intended to be a unit, with more lecture content in week 3, and more practice (assignment and quizzing) in week 4.",
                    "",
                    "",
                    ""
                ],
                "Modules Duration": [
                    "14 minutes",
                    "1 hour",
                    "3 hours",
                    "1 hour",
                    "3 hours"
                ],
                "Modules Name": [
                    "Preface",
                    "User Research Methods — Part 1",
                    "User Research Methods — Part 2",
                    "Analyzing and Delivering User Research",
                    "Ideation and Idea Selection"
                ],
                "Rating": 4.6,
                "Similarity": 0.6157177686691284,
                "Skills": "People Analytics, Data Collection, Statistical Analysis, Data Analysis, Interviewing Skills, Surveys, UI/UX Research, User Interface (UI), Design Research, User Research, User Centered Design, Ideation, Qualitative Research, Persona Development, User Experience, User Story",
                "Subcategory": "Design and Product",
                "Title": "User Research and Design",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of Interaction Design Specialization",
                "Duration": "1 - 3 Months",
                "Enrolled": 31840,
                "Institution": "University of California San Diego",
                "Level": "Intermediate",
                "Modules Description": [
                    "In this module, you will learn basic concepts relevant to the design and analysis of experiments, including mean comparisons, variance, statistical significance, practical significance, sampling, inclusion and exclusion criteria, and informed consent. You'll also learn to think of an experiment in terms of usability, its participants, apparatus, procedure, and design & analysis. This module covers lecture videos 1-2.",
                    "In this module, you will learn how to analyze user preferences (or other tallies) using tests of proportions. You will also get up and running with R and RStudio. Topics covered include independent and dependent variables, variable types, exploratory data analysis, p-values, asymptotic tests, exact tests, one-sample tests, two-sample tests, Chi-Square test, G-test, Fisher's exact test, binomial test, multinomial test, post hoc tests, and pairwise comparisons. This module covers lecture videos 3-9.",
                    "In this module, you will learn how to design and analyze a simple website A/B test. Topics include measurement error, independent variables as factors, factor levels, between-subjects factors, within-subjects factors, dependent variables as responses, response types, balanced designs, and how to report a t-test. You will perform your first analysis of variance in the form of an independent-samples t-test. This module covers lecture videos 10-11.",
                    "In this module, you will learn about how to ensure that your data is valid through the design of experiments, and that your analyses are valid by understanding and testing for certain assumptions. Topics include how to achieve experimental control, confounds, ecological validity, the three assumptions of ANOVA, data distributions, residuals, normality, homoscedasticity, parametric versus nonparametric tests, the Shapiro-Wilk test, the Kolmogorov-Smirnov test, Levene's test, the Brown-Forsythe test, and the Mann-Whitney U test. This module covers lecture videos 12-15.",
                    "In this module, you will learn about one-factor between-subjects experiments. The experiment examined will be a between-subjects study of task completion time with various programming tools. You will understand and analyze data from two-level factors and three-level factors using the independent-samples t-test, Mann-Whitney U test, one-way ANOVA, and Kruskal-Wallis test. You will learn how to report an F-test. You will also understand omnibus tests and how they relate to post hoc pairwise comparisons with adjustments for multiple comparisons. This module covers lecture videos 16-18.",
                    "In this module, you will learn about one-factor within-subjects experiments, also known as repeated measures designs. The experiment examined will be a within-subjects study of subjects searching for contacts in a smartphone contacts manager, including the analysis of times, errors, and effort Likert-type scale ratings. You will learn counterbalancing strategies to avoid carryover effects, including full counterbalancing, Latin Squares, and balanced Latin Squares. You will understand and analyze data from two-level factors and three-level factors using the paired-samples t-test, Wilcoxon signed-rank test, one-way repeated measures ANOVA, and Friedman test. This module covers lecture videos 19-23.",
                    "In this module, you will learn about experiments with multiple factors and factorial ANOVAs. The experiment examined will be text entry performance on different smartphone keyboards while sitting, standing, and walking. Topics include mixed factorial designs, interaction effects, factorial ANOVAs, and the Aligned Rank Transform as a nonparametric factorial ANOVA. This module covers lecture videos 24-27.",
                    "In this module, you will learn about analyses for non-normal or non-numeric responses for between-subjects experiments using Generalized Linear Models (GLM). We will revisit three previous experiments and analyze them using generalized models. Topics include a review of response distributions, nominal logistic regression, ordinal logistic regression, and Poisson regression. This module covers lecture videos 28-29.",
                    "In this module, you will learn about mixed effects models, specifically Linear Mixed Models (LMM) and Generalized Linear Mixed Models (GLMM). We will revisit our prior experiment on text entry performance on smartphones but this time, keeping every single measurement trial as part of the analysis. The full set of analyses covered in this course will also be reviewed. This module covers lecture videos 30-33."
                ],
                "Modules Duration": [
                    "58 minutes",
                    "1 hour",
                    "1 hour",
                    "1 hour",
                    "56 minutes",
                    "1 hour",
                    "2 hours",
                    "1 hour",
                    "2 hours"
                ],
                "Modules Name": [
                    "Basic Experiment Design Concepts",
                    "Tests of Proportions",
                    "The T-Test",
                    "Validity in Design and Analysis",
                    "One-Factor Between-Subjects Experiments",
                    "One-Factor Within-Subjects Experiments",
                    "Factorial Experiment Designs",
                    "Generalizing the Response",
                    "The Power of Mixed Effects Models"
                ],
                "Rating": 3.6,
                "Similarity": 0.6157134771347046,
                "Skills": "Usability Testing, Statistical Analysis, Statistical Hypothesis Testing, User Experience, Data Analysis, Experimentation, Statistical Modeling, R Programming, UI/UX Research, Statistics, Human Computer Interaction, A/B Testing, Research Design",
                "Subcategory": "Design and Product",
                "Title": "Designing, Running, and Analyzing Experiments",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "No Description",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Coursera Instructor Network",
                "Level": "Intermediate",
                "Modules Description": [
                    "In this course, you'll explore practical UX strategies to bridge the gap between shipped features and real user needs. Through hands-on experience with tools like Figma and JTBD templates, you'll learn to create empathy maps, user journey flows, and feature scorecards. You'll also evaluate product experiences using heuristic methods and build alignment across teams to prioritize user-centric design decisions that drive engagement and growth."
                ],
                "Modules Duration": [
                    "3 hours"
                ],
                "Modules Name": [
                    "Advanced UX Strategies for Product Managers"
                ],
                "Rating": "No rating",
                "Similarity": 0.6025233268737793,
                "Skills": "Storytelling, Usability Testing, User Centered Design, UI/UX Strategy, User Research, Prioritization, Usability, Figma (Design Software), Human Centered Design, Product Improvement, Design Research, Wireframing, User Experience Design, User Experience, User Feedback, Data Storytelling, Design Strategies",
                "Subcategory": "Design and Product",
                "Title": "Advanced UX Strategies for Product Managers",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of Interaction Design Specialization",
                "Duration": "1 - 3 Months",
                "Enrolled": 5044,
                "Institution": "University of California San Diego",
                "Level": "Mixed",
                "Modules Description": [
                    "Welcome to the Interaction Design Capstone Project!",
                    "As Yogi Berra said, you can observe a lot just by watching. Watching how people do things is a great way to learn their goals and values, and come up with design insight. We call this needfinding. This module trains your eyes and ears to come up with user needs, breakdowns, clever hacks, and opportunities for improvement.",
                    "To maximize your chances of having a great idea, it helps to generate a lot of ideas. Brainstorming is a strategy for rapidly generating lots of ideas. It was named by advertising executive Alex Osborn in his 1953 book, Applied Imagination. When brainstorming, go for volume and defer judgment. Often, something that seems like a crazy idea can lead to something that's a really good idea. Immerse yourself: it can help to use a whiteboard, butcher paper, or stick post-its on a wall. These ideas will become the 'soil' for growing your designs.",
                    "Prototyping is the pivotal activity that structures innovation, collaboration, and creativity in design. Prototyping gets ideas out of your head and into the world. Like a conversation, your ideas will evolve as you articulate them and make them concrete. Prototypes are quick and dirty, not careful museum pieces. The key to prototyping is to jump right in. It's a tool to see what's working, what challenges emerge, and to share your ideas with others. Review the user needs you brainstormed. In this assignment, you will flesh out your design ideas by storyboarding and making paper prototypes.",
                    "Design can succeed (or fail) in many ways. That said, there are common heuristics that will get you on the right path. In this module, you will conduct heuristic evaluations (HEs) of another learner's paper prototype. The heuristic evaluations will be a way to highlight usability issues, and think about how to improve them.",
                    "A journey of a thousand miles begins with a single step. Figuring out what that first step is--and then what the one after that is--can be especially daunting with creative projects. Making forward progress is a lot easier if you write down concrete, actionable goals. This is the main benefit of a development plan. A development plan also helps you track momentum. Are things progressing at the pace you expected? Faster? Slower? Writing a time estimate into your plan and tracking how long it actually took helps you gauge your pace. The first steps of your plan should be the skeleton that forms the core screens of your design.",
                    "Crunch time! Your interactive prototypes have to be ready for user testing by the end of this assignment.",
                    "In this assignment, you will test your prototype in person with two people to find usability bugs & potential improvements.",
                    "You've got data from online users that compares two alternatives. How can you tell whether there is a real difference? Statistical tests, like the CHI-squared test, tell you whether the behavior you observed was likely to have occurred by chance, or whether there's likely to be a real difference between the designs. A/B experiments like these are becoming increasingly popular in industry because experiments help you test your assumptions.",
                    "You've done all this great work, and your hard effort has paid off. You've brainstormed, prototyped, designed, iterated, refined, and evaluated. Now's your chance to share your work with the world. This is a great opportunity to tell your design story, and use it as a portfolio to impress your friends, family, and potential employers."
                ],
                "Modules Duration": [
                    "24 minutes",
                    "2 hours",
                    "1 hour",
                    "3 hours",
                    "3 hours",
                    "4 hours",
                    "5 hours",
                    "4 hours",
                    "6 hours",
                    "3 hours"
                ],
                "Modules Name": [
                    "Design Thinking Capstone",
                    "Needfinding",
                    "Ideation",
                    "Prototype",
                    "Design Heuristics",
                    "A Plan & a Skeleton",
                    "Ready for Testing",
                    "Test your prototype",
                    "Results!",
                    "Show & Tell"
                ],
                "Rating": 4.5,
                "Similarity": 0.5967384576797485,
                "Skills": "Creativity, Human Centered Design, Design Thinking, Mockups, Design Research, User Experience Design, Usability, A/B Testing, User Interface and User Experience (UI/UX) Design, User Research, Prototyping, Interaction Design, Innovation, Usability Testing, Ideation",
                "Subcategory": "Design and Product",
                "Title": "Interaction Design Capstone Project",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "No Description",
                "Duration": "1 - 3 Months",
                "Enrolled": 161225,
                "Institution": "University of Pennsylvania",
                "Level": "Mixed",
                "Modules Description": [
                    "Gamification is a new field, but games are ancient. In this first module, we'll look at what gamification is, why organizations are applying it, and where it comes from. While there isn't universal agreement on the scope of the field, a set of concepts are clearly representative of gamification. The second lesson explains why the concept of games is deeper than most people realize, and how game design serves as a foundation for gamification.",
                    "What exactly does it mean to apply game design principles in non-game contexts? In this module, we'll discuss how game designers approach their craft, and how to see any situation through the lens of game design. Then we'll examine the raw materials of games and gamification, known as game elements. We'll earn how to break down a game into its constituent parts and apply them to create gamified systems.",
                    "Gamification is a technique for motivation, so it ties very directly into psychology. This unit introduces the major psychological concepts relevant to gamification. The first lesson focuses on behavioral approaches and reward design; the second identifies the risks and alternatives to this approach.",
                    "Gamification done well is a form of design. This module describes the design process, and provides a six-step  framework to apply to any gamification project. The second lesson identifies important considerations and options for developing creative, human-centered, thoughtful gamification solutions.",
                    "This module describes particular challenges and opportunities when applying gamification in two contexts: within an organization, and in social impact or behavior change environments.",
                    "There are many legitimate limitations, concerns, and dangers from gamification. Some of them can be avoided through thoughtful design, but others must be considered directly in any implementation. The final lesson details gamification-related techniques that go beyond those covered throughout the course, and concludes with a look toward the future."
                ],
                "Modules Duration": [
                    "2 hours",
                    "3 hours",
                    "4 hours",
                    "2 hours",
                    "4 hours",
                    "2 hours"
                ],
                "Modules Name": [
                    "Gamification and Games",
                    "Deconstructing Games",
                    "Motivation and Psychology",
                    "Design",
                    "Applications",
                    "Gamification in Perspective"
                ],
                "Rating": 4.8,
                "Similarity": 0.5875307321548462,
                "Skills": "Solution Design, Human Centered Design, Emerging Technologies, Drive Engagement, Behavioral Economics, Psychology, Design Thinking, Risk Analysis, Game Design, Employee Engagement, Organizational Development, Marketing, Industrial and Organizational Psychology, Customer Engagement",
                "Subcategory": "Design and Product",
                "Title": "Gamification",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "No Description",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Coursera",
                "Level": "Intermediate",
                "Modules Description": [
                    "Learn to design intuitive navigation systems and micro-interactions, implement responsive design principles, and utilize Figma's advanced prototyping features to create complex, high-fidelity interactive prototypes for the GreenLeaf Grocers app."
                ],
                "Modules Duration": [
                    "4 hours"
                ],
                "Modules Name": [
                    "Advanced Prototyping and Interaction Design"
                ],
                "Rating": "No rating",
                "Similarity": 0.5815405249595642,
                "Skills": "User Interface (UI), Figma (Design Software), User Experience Design, Interaction Design, Usability, Animations, Responsive Web Design, Prototyping, Mockups, User Flows",
                "Subcategory": "Design and Product",
                "Title": "Interaction Intelligence: Advanced Prototyping with Figma",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of User Experience Research and Design Specialization",
                "Duration": "1 - 3 Months",
                "Enrolled": 40342,
                "Institution": "University of Michigan",
                "Level": "Beginner",
                "Modules Description": [
                    "In this module, you will be introduced to the nature of design, the design process, and methods of formative research. You are expected to spend 2 to 3 hours on this module's workload. By the end of this module, you will understand the user experience design process and how to conduct formative research.",
                    "This module will cover one of the practical topics in this course --- ideation. You will brainstorm and sketch possible solutions to your design problem in this module's assignment. You will also share your sketches with your fellow learners, hear their thoughts about your designs, and provide feedback on their work. By the end of this module, you will gain an understanding of various methods of ideation, as well as the structure developed by Haakon Faste and Eric Paulos for brainstorming.",
                    "This module will introduce the other practical topics --- creation of early design representations like scenarios, personas, and storyboards that illuminate findings about user needs discovered through your formative research. By the end of this module, you will learn how designers move from formative research to a design solution, how the \"Questions, Options, Criteria\" framework can help us make design decisions, and gain hands-on experience in creating personas, scenarios, and storyboards.",
                    "In this module, we will start with understanding the conceptual underpinnings of user interactions by introducing the basic building blocks of user interaction. In addition to lectures, quizzes and discussions, this module involves actual design work: planning out the kinds of information the system you are designing will need to take in, and the kinds of feedback it will need to provide to users. By the end of this module, you will be able to define the elements of user interaction and types of data input. You will also be able to design effective inputs and outputs to enable users to complete tasks successfully as well as conceptualize design problems by using the building blocks of user interaction.",
                    "Module 5 will provide an overview of different forms of prototyping. Your design work for this module will be wireframing the main screens of your application. By the end of this module, you will be able to identify the characteristics and applications of low-fidelity and hi-fidelity prototypes and apply the most effective prototype for answering a particular design question. Also, you will learn how to test design concepts and functionality by utilizing wireframes and create low-fidelity and hi-fidelity prototypes to assess and improve your design.",
                    "This module introduces some of the issues that designers need to think about when prototyping, such as defaults and mental models. You will create a functional low-fidelity prototype of your design. By the end of this module, you will understand the affordances and limitations of interface formats, learn to evaluate how the default features of a design impact the user experience, identify potential consequences of usage beyond a design's intentions, and describe the gulfs of execution and evaluation."
                ],
                "Modules Duration": [
                    "1 hour",
                    "2 hours",
                    "3 hours",
                    "2 hours",
                    "2 hours",
                    "3 hours"
                ],
                "Modules Name": [
                    "Introduction to the Design Process",
                    "Ideation",
                    "Design Constraints and Making Choices",
                    "Building Blocks of User Interaction",
                    "Low to Hi-Fidelity Prototyping",
                    "Conceptual Issues in Prototyping and Design"
                ],
                "Rating": 4.7,
                "Similarity": 0.5776252150535583,
                "Skills": "Prototyping, Wireframing, User Experience Design, Conceptual Design, User Research, User Centered Design, Ideation, Storyboarding, Interaction Design, Mockups, User Story, Usability Testing, User Interface (UI)",
                "Subcategory": "Design and Product",
                "Title": "UX Design: From Concept to Prototype",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of Virtual Reality Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 102597,
                "Institution": "University of London",
                "Level": "Beginner",
                "Modules Description": [
                    "In this week, we'll cover the basics of VR. We'll start by sharing a definition of Virtual Reality, and exploring VR hardware, and then you'll see demonstrations of a range of VR Head Mounted Devices. In the latter part of the week, you will hear more about the history of Virtual Reality and finish the week by drafting your ideas for a VR application.",
                    "This week, you'll learn more about the different applications of VR- from news and documentaries, to sports, therapy, and games. You will also learn more about the VR Technical Framework, and will have the opportunity to share your thoughts on VR applications with your peers.",
                    "In this week, Professor Mel Slater will take us through the Three Illusions. We'll discuss Place Illusion, Plausibility Illusion, and Embodiment Illusion, with some interesting tricks along the way!",
                    ""
                ],
                "Modules Duration": [
                    "2 hours",
                    "4 hours",
                    "3 hours",
                    "3 hours"
                ],
                "Modules Name": [
                    "Virtual Reality- Hardware and History",
                    "VR Applications",
                    "The Psychology of VR: the Three Illusions",
                    "Challenges in Virtual Reality"
                ],
                "Rating": 4.7,
                "Similarity": 0.5722833275794983,
                "Skills": "Human Computer Interaction, Rehabilitation, Journalism, Augmented and Virtual Reality (AR/VR), Virtual Reality, Unity Engine, Human Factors, Display Devices, Mental Health Therapies, Virtual Environment, Video Game Development",
                "Subcategory": "Design and Product",
                "Title": "Introduction to Virtual Reality",
                "Type": "Course"
            }
        ]
    },
    {
        "input": {
            "skill": [
                "Agile",
                "Scrum",
                "Kanban",
                "Sprint Retrospectives",
                "Waterfall Methodology",
                "Stakeholder Engagement",
                "Product Lifecycle Management"
            ],
            "category": [
                "Data & Product",
                "IT & Engineering"
            ],
            "top_n": 10
        },
        "recommendations": [
            {
                "Category": "Information Technology",
                "Description": "No Description",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 2174,
                "Institution": "Northeastern University",
                "Level": "Beginner",
                "Modules Description": [
                    "In this module, we will explore how and why organizations implement agile methodologies to enhance daily work experiences, interactions, collaboration, adaptability, and overall job satisfaction. As an agile leader, it's important to understand these principles. This knowledge will equip you with the necessary skills to foster a dynamic and responsive work environment and empower you to lead engaged, adaptable teams.",
                    "In this module, you'll learn about organizational practices and Agile tools used to discuss implementation priorities in development teams. You'll explore Agile technical practices that are tailored to project needs. You'll examine Agile artifacts and learn how they create project transparency and teamwork. You'll also develop the interpersonal skills you will need to collaborate and communicate in Agile software development contexts.",
                    "In this module, you'll explore and compare predictive thinking, Waterfall, and Agile methodologies, with a special focus on their strategies for planning, execution, and adaptation. You'll gain insights into requirements engineering and how to apply them across project contexts. You'll also cover techniques for gathering, documenting, and organizing requirements. We'll also explore the architectural and design principles of Agile methodologies. By the end of this module, you'll be able to make informed decisions, tailor strategies to specific project needs, and successfully steer Agile projects.",
                    "In this module, you'll explore software development life cycles (SDLC), and assess their suitability for different projects. You'll learn more about capability maturity model integration (CMMI) which focuses on quality management."
                ],
                "Modules Duration": [
                    "3 hours",
                    "2 hours",
                    "2 hours",
                    "2 hours"
                ],
                "Modules Name": [
                    "Introduction to Agile",
                    "Organizational Practices and Agile Tools",
                    "Predictive Thinking, Waterfall, and Agile methodologies",
                    "Software Development Life Cycles (SDLC) & Capability Maturity Model Integration (CMMI)"
                ],
                "Rating": 4.8,
                "Similarity": 0.812919020652771,
                "Skills": "Agile Project Management, Software Development Life Cycle, Application Lifecycle Management, Agile Methodology, Interpersonal Communications, Requirements Analysis, Project Management, Agile Software Development, User Story, Sprint Retrospectives, Continuous Improvement Process, Software Development Methodologies, Quality Management, Waterfall Methodology, Sprint Planning, Cross-Functional Collaboration, Scrum (Software Development)",
                "Subcategory": "Support and Operations",
                "Title": "Agile Dev Practices: SDLC & Project Management",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "No Description",
                "Duration": "1 - 3 Months",
                "Enrolled": 1716,
                "Institution": "digital.auto",
                "Level": "Beginner",
                "Modules Description": [
                    "Welcome to our essentials course on software-defined vehicles. In this first module, we would like to introduce the course, the topic, and the instructors to you.",
                    "In this first module, we will cover the basics of SDV. We will define what SDV is, but more importantly, we will explore the various aspects of how the transformation in the automotive industry was initiated, leading to the necessity and emergence of SDVs.",
                    "In this module we will go through a number of technical evolutions that influenced or led to the transformation in the automotive industry.",
                    "In this module we will go through the building blocks of an SDV one by one. We will not go into details, but will put together the whole picture from a birds view perspective.",
                    "In this module we will discuss several implementation strategies that make it possible to develop faster, adjust to changes and customer needs.",
                    "In this module we will go over how the available AI technologies influence and support the development of SDVs in the automotive industry."
                ],
                "Modules Duration": [
                    "28 minutes",
                    "1 hour",
                    "1 hour",
                    "1 hour",
                    "2 hours",
                    "1 hour"
                ],
                "Modules Name": [
                    "Welcome to the course",
                    "Essentials",
                    "Lessons Learned",
                    "Building Blocks",
                    "Implementation Strategies",
                    "The impact of AI"
                ],
                "Rating": 4.7,
                "Similarity": 0.7977182269096375,
                "Skills": "Software Architecture, Artificial Intelligence, Software Development, Virtualization, Embedded Software, Systems Architecture, Digital Transformation, Software Development Life Cycle, Automation",
                "Subcategory": "Design and Product",
                "Title": "SDV 101: Introduction to Software Defined Vehicles",
                "Type": "Course"
            },
            {
                "Category": "Information Technology",
                "Description": "No Description",
                "Duration": "1 - 3 Months",
                "Enrolled": 0,
                "Institution": "Packt",
                "Level": "Beginner",
                "Modules Description": [
                    "In this module, we will welcome you to the course and introduce your instructor. You'll learn about the course structure, the key topics that will be covered, and the expertise of your instructor. This foundational knowledge will help you understand what to expect and how to make the most of this learning experience.",
                    "In this module, we will delve into the basics of Kanban and the Kanban board. You'll gain an understanding of Kanban principles and see how a Kanban board functions as a visual tool for managing tasks and projects effectively. This introduction will set the stage for using Kanban in various work scenarios.",
                    "In this module, we will focus on improving processes by identifying inefficiencies and issues. You'll learn how to spot inefficiencies in your workflows, understand the consequences of underutilized resources, and explore techniques for marking and managing tasks. These skills are crucial for streamlining operations and enhancing productivity.",
                    "In this module, we will explore essential Kanban practices. You'll learn what it means to define \"done\" in the context of Kanban, how to conduct daily standup meetings to maintain team alignment, and how to specify rules to ensure consistent practice. Mastering these practices will help you implement Kanban effectively in your projects.",
                    "In this module, we will cover key Agile concepts that complement Kanban. You'll be introduced to the foundational ideas of Agile, learn about the product backlog and its management, and discover various estimation techniques like T-Shirt sizing and Fibonacci sequences. This comprehensive overview will enhance your ability to apply Agile methodologies in conjunction with Kanban."
                ],
                "Modules Duration": [
                    "12 minutes",
                    "27 minutes",
                    "54 minutes",
                    "30 minutes",
                    "3 hours"
                ],
                "Modules Name": [
                    "Welcome to the Course",
                    "Introduction to Kanban and Kanban Board",
                    "Process Improvement: Identifying Inefficiencies/Issues",
                    "Kanban Practices",
                    "Key Agile Concepts"
                ],
                "Rating": "No rating",
                "Similarity": 0.7784081697463989,
                "Skills": "Project Estimation, Workflow Management, Process Optimization, Estimation, Agile Project Management, Backlogs, Project Management Software, Resource Utilization, User Story, Process Improvement, Kanban Principles, Agile Software Development, Sprint Planning, Agile Methodology",
                "Subcategory": "Support and Operations",
                "Title": "Kanban for Software Project Management",
                "Type": "Course"
            },
            {
                "Category": "Data Science",
                "Description": "This course is part of AI in Sports: The Approach of a Club Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Real Madrid Graduate School Universidad Europea",
                "Level": "Beginner",
                "Modules Description": [
                    "This foundational module introduces you to the essential concepts and technologies that power artificial intelligence in the modern world. Through three comprehensive lessons, you'll explore the fundamental principles of AI, understand key technologies driving the field, and discover diverse real-world applications across industries. Beginning with core AI concepts and terminology, you'll progress to examining the technological infrastructure enabling AI systems, and conclude by investigating how various sectors are being transformed through AI implementation. This module establishes the critical knowledge base necessary for understanding AI's specific applications in sports contexts, preparing you for more advanced explorations in subsequent modules.",
                    "This advanced module explores cutting-edge AI methodologies and their practical implementations across various domains. Through three comprehensive lessons, you'll delve into sophisticated machine learning and deep learning techniques, discover the transformative potential of natural language processing and large language models, and examine emerging AI trends shaping our future. Building on foundational AI knowledge, this module provides deeper technical understanding of how modern AI systems function and evolve. You'll gain insights into the latest developments in AI research and applications, preparing you to recognize and evaluate opportunities for implementing these technologies in sports and beyond.",
                    "This specialized module explores the dynamic relationship between artificial intelligence, technology, and the world of sports. Through three comprehensive lessons, you'll discover how digital innovation is revolutionizing athletic performance, fan engagement, and sports business operations. Beginning with an examination of how technology and sports intersect across multiple touchpoints, you'll then trace the historical development and current state of AI applications in sporting contexts. The module concludes with a critical exploration of the ethical dimensions and privacy challenges that emerge as sports organizations collect and leverage increasingly sophisticated data. Designed for both sports professionals and technology enthusiasts, this module provides essential insights into how AI is transforming traditional approaches to training, competition, and sports management while raising important questions about responsible innovation.",
                    "This practical module examines the cutting-edge technologies and platforms transforming data collection and analysis in modern sports. Through three focused lessons, you'll explore the hardware and software ecosystems driving innovation in athletic performance monitoring and fan experience enhancement. Beginning with an in-depth look at wearable technology and Internet of Things (IoT) applications, you'll discover how these innovations provide unprecedented insights into athlete biomechanics and physiological responses. You'll then examine sophisticated data analytics platforms that convert raw information into actionable intelligence for coaches, scouts, and performance staff. The module culminates with a fascinating exploration of smart stadium infrastructure, showcasing how integrated technology systems are revolutionizing venue management and spectator engagement. By understanding these practical tools and their implementations, you'll gain valuable knowledge about the technological backbone supporting modern sports operations and strategic decision-making."
                ],
                "Modules Duration": [
                    "3 hours",
                    "5 hours",
                    "2 hours",
                    "3 hours"
                ],
                "Modules Name": [
                    "Foundations of Artificial Intelligence",
                    "Modern AI Techniques and Applications",
                    "AI and Technology in Sports",
                    "Tools and Technologies in Sports AI"
                ],
                "Rating": "No rating",
                "Similarity": 0.7659059166908264,
                "Skills": "Performance Appraisal, Natural Language Processing, Internet Of Things, Machine Learning, Technology Solutions, Artificial Intelligence, Scikit Learn (Machine Learning Library), Health Technology, Data Analysis, Emerging Technologies, Big Data, Large Language Modeling, Data-Driven Decision-Making, Technology Strategies, Data Analysis Software, Data Ethics, Deep Learning, Statistical Methods, Advanced Analytics, Analytics",
                "Subcategory": "Machine Learning",
                "Title": "Introduction to AI and Technology in Sports",
                "Type": "Course"
            },
            {
                "Category": "Information Technology",
                "Description": "This course is part of Microsoft Azure Fundamentals AZ-900 Exam Prep Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Microsoft",
                "Level": "Beginner",
                "Modules Description": [
                    "In this module, you will build a foundation for understanding Azure Monitor, Microsoft's comprehensive cloud monitoring solution. You'll explore key concepts, components, and features essential for effectively monitoring applications and infrastructure within the Azure ecosystem. You'll be guided through the fundamental principles of Azure Monitor, its diverse features, and the practical aspects of configuring basic monitoring. By engaging with real-world use cases, case studies, and hands-on activities, you'll develop a holistic understanding of Azure Monitor's capabilities.",
                    "In this module, you will explore advanced Azure networking configurations. You'll focus on key components such as Azure Blob Storage, delving into its configurations, optimization strategies, and integration possibilities with other Azure services. Through hands-on experience and theoretical insights, you will gain proficiency in configuring and securing Azure Blob Storage.  You'll also investigate Log Analytics capabilities, familiarizing yourself with its query language and advanced techniques to extract meaningful insights from logs.",
                    "This module aims to  help you to establish a solid understanding of Azure backup concepts and build the skills required for effective backup configurations. In this module, you will focus on the foundational aspects of configuring backups in the Azure environment. You will first be introduced to essential concepts of backup strategies, emphasizing the importance of regular backups. Then, the focus will shift to practical configurations, specifically covering file and folder backups, with hands-on exercises for reinforcement. Later on, the discussion will extend to virtual machine backups, providing both theoretical insights and practical application through guided configurations. You'll also learn how to keep your virtual machines up-to-date in Azure. You'll understand why regular updates are important and how to set up automatic updates for efficiency.",
                    "In this module, you'll complete a hands-on project. You'll focus on setting up a monitoring solution in Azure, using what you've learned to design, configure, and improve monitoring components. This project gives you a chance to apply your skills in a real-world scenario."
                ],
                "Modules Duration": [
                    "5 hours",
                    "5 hours",
                    "5 hours",
                    "4 hours"
                ],
                "Modules Name": [
                    "Introduction to Azure Monitor",
                    "Configuring Storage Accounts",
                    "Azure Backup and Maintenance",
                    "Comprehensive Backup and Disaster Recovery Plan for a Simulated Azure Environment"
                ],
                "Rating": 4.9,
                "Similarity": 0.7561786770820618,
                "Skills": "Encryption, Cloud Security, Infrastructure As A Service (IaaS), File Management, Cloud Storage, Microsoft Azure, Data Storage, Disaster Recovery, Data Security, Event Monitoring, System Monitoring, Query Languages, Continuous Monitoring, Patch Management, Virtual Machines",
                "Subcategory": "Cloud Computing",
                "Title": "Managing Azure Infrastructure: Storage, Monitoring & Backup",
                "Type": "Course"
            },
            {
                "Category": "Information Technology",
                "Description": "This course is part of ISC2 Systems Security Certified Practitioner (SSCP)",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 1981,
                "Institution": "ISC2",
                "Level": "Beginner",
                "Modules Description": [
                    "In management science terms, maturing a process or practice means taking positive steps over time to make it more reliable, repeatable, and efficient. In practice, this means getting better each day while being able to show the measurements that both demonstrate improvement and suggest other opportunities to improve. Risk management for organizations works best when it uses evidence-based reasoning to identify and characterize issues and take actions as necessary to deal with them.  \n\nThis course will explore how to manage the risks related to information systems. It is time to bring these ideas together in a context of continuous maturity modeling, measuring, and monitoring, which we will see is focused on the here and now. Risk alignment works best at the strategic, long-term level of planning; risk maturation, by contrast, can be most effective when considered in the day-to-day of business operations. This is sometimes called operationalizing the approach to risk management and maturation."
                ],
                "Modules Duration": [
                    "6 hours"
                ],
                "Modules Name": [
                    "Overview"
                ],
                "Rating": 4.7,
                "Similarity": 0.7529878616333008,
                "Skills": "Risk Analysis, Vulnerability Management, Risk Mitigation, Enterprise Risk Management (ERM), Network Monitoring, Security Information and Event Management (SIEM), Continuous Monitoring, Risk Management, Intrusion Detection and Prevention, Security Controls, Technical Communication, Cyber Risk, Compliance Management, Vulnerability Assessments, Network Analysis, Business Risk Management, Threat Management, Operational Risk",
                "Subcategory": "Security",
                "Title": "Risk Identification, Monitoring, and Analysis",
                "Type": "Course"
            },
            {
                "Category": "Information Technology",
                "Description": "This course is part of Certified Kubernetes Application Developer (CKAD) Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 3200,
                "Institution": "LearnKartS",
                "Level": "Beginner",
                "Modules Description": [
                    "This module covers Kubernetes fundamentals, including its architecture and the relationship between Kubernetes and containers. By the end of this module, learners will grasp Kubernetes basics, facilitating efficient deployment and management of containerized applications through orchestration.",
                    "This module covers Kubernetes configuration and management, including YAML, pod, deployment, and replica set management, as well as networking, service, and storage management. By the end of this module, the learners will configure and manage Kubernetes objects effectively."
                ],
                "Modules Duration": [
                    "2 hours",
                    "2 hours"
                ],
                "Modules Name": [
                    "Kubernetes Fundamentals and Its Deployment",
                    "Kubernetes Pods, Deployments, Replica Sets, Networking and Storage"
                ],
                "Rating": 4.0,
                "Similarity": 0.7523941993713379,
                "Skills": "Systems Architecture, Containerization, Data Storage, Microservices, Command-Line Interface, YAML, Cloud-Native Computing, Application Deployment, Scalability, Network Architecture, Kubernetes",
                "Subcategory": "Cloud Computing",
                "Title": "Kubernetes Fundamentals",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of Preparation for CompTIA A+ Certification Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 6433,
                "Institution": "IBM",
                "Level": "Intermediate",
                "Modules Description": [
                    "In this module, you will learn about the eligibility requirements for the CompTIA A+ Certification exams, the domains and testing methods, exam-taking strategies, and additional study resources and tips. You can also assess your readiness for the CompTIA A+ Core 1 and Core 2 mock exams through two practice quizzes.",
                    "In this module, you will complete a CompTIA A+ Core 1 exam simulation with the same number and type of questions.",
                    "In this module, you will complete a CompTIA A+ Core 2 exam simulation with the same number and type of questions."
                ],
                "Modules Duration": [
                    "2 hours",
                    "1 hour",
                    "1 hour"
                ],
                "Modules Name": [
                    "CompTIA A+ Core 1 and Core 2 Exam Overview",
                    "Mock Exam for CompTIA A+ Certification: Core 1",
                    "Mock Exam for CompTIA A+ Certification: Core 2"
                ],
                "Rating": 4.7,
                "Similarity": 0.7392808198928833,
                "Skills": "Simulations, Microsoft Windows, Infrastructure Security, Technical Services, Mac OS, Operating Systems, Network Troubleshooting, General Networking, Technical Support, Computer Networking, Network Administration, System Support, Desktop Support, Unix, Hardware Troubleshooting, Information Technology, Computer Hardware, Mobile Security, Virtualization, Network Security",
                "Subcategory": "Computer Security and Networks",
                "Title": "Practice Exams for CompTIA A+ Certification: Core 1 & Core 2",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "No Description",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Packt",
                "Level": "Intermediate",
                "Modules Description": [
                    "In this module, we will lay the groundwork for your journey into software security testing. You'll begin with an introduction to the course, followed by setting up your testing environment with Kali Linux. We'll cover essential terminology, explore key methodologies and standards, and discuss the continuous process of software testing. By the end of this section, you'll have a solid foundation to build upon in the subsequent modules.",
                    "In this module, we will delve into the core concepts and techniques of software security testing. We'll start with an in-depth look at the HTTP protocol, followed by encoding methods. You'll learn about information-gathering techniques, configuration and management testing, and explore identity management and authentication processes. Additionally, we'll cover authorization testing and session management, providing you with essential skills for identifying and mitigating security risks.",
                    "In this module, we will focus on advanced testing techniques and reporting. You'll learn about input validation and error handling vulnerabilities, delve into the principles of cryptography, and explore creative approaches to testing business logic flaws. We'll also cover client-side testing and conclude with a comprehensive guide to reporting your findings. This section will equip you with advanced skills and knowledge to conduct thorough and effective software security testing."
                ],
                "Modules Duration": [
                    "1 hour",
                    "4 hours",
                    "4 hours"
                ],
                "Modules Name": [
                    "Foundations of Software Security Testing",
                    "Core Concepts and Techniques",
                    "Advanced Testing and Reporting"
                ],
                "Rating": "No rating",
                "Similarity": 0.7285699248313904,
                "Skills": "Secure Coding, Vulnerability Assessments, Data Validation, Network Protocols, Authorization (Computing), Web Applications, Software Testing, Business Logic, Identity and Access Management, Cybersecurity, Encryption, Authentications, Cryptography",
                "Subcategory": "Computer Security and Networks",
                "Title": "Software Security Testing",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "Drive to Value with Agile Methods. Master an adaptive approach to product development",
                "Duration": "3 - 6 Months",
                "Enrolled": 62252,
                "Institution": "University of Virginia",
                "Level": "Beginner",
                "Modules Description": [
                    "How to evaluate and explain the relevance of concepts and practices from the agile development methodologies\nHow to create a strong shared perspective and drive to value using design methods like personas and problem scenarios\nHow to diagnose what software will be valuable to the user and how to test your ideas using agile user stories and prototypes\nHow to facilitate narrative collaboration with user stories and prototypes",
                    "How to drive valuable outcomes for your user and reduce waste for your team by diagnosing and prioritizing what you need to know about them\nHow to focus your practice of agile by pairing qualitative and quantitative analytics\nHow to do just enough research when you need it by running design sprints\nHow to accelerate value delivery by investing in your product pipeline",
                    "How to naturally, habitually tie your team's work to actionable analytics that help you drive to user value.\nHow to pair your hypotheses on customer personas and problem with analytics.\nHow to test propositions (a la Lean Startup) so you don't build features no one wants.\nHow to instrument actionable observation into everything you build (a la Lean UX).",
                    "How to select and test agile practices to adaptively improve your team's practice of agile\nHow to create an agile team charter that aligns your team's focus with company strategy while leaving it free to work creatively\nHow to facilitate retrospectives with your team to iteratively, collaboratively improve your practice of agile\nHow to support your team's transition to agile"
                ],
                "Modules Duration": [
                    "9 hours",
                    "10 hours",
                    "15 hours",
                    "11 hours"
                ],
                "Modules Name": [
                    "Agile Meets Design Thinking",
                    "Hypothesis-Driven Development",
                    "Product Analytics and AI",
                    "Managing an Agile Team"
                ],
                "Rating": 4.7,
                "Similarity": 0.7121953368186951,
                "Skills": "Agile Product Development, Product Development, Team Leadership, Team Building, Persona (User Experience), Usability Testing, Customer Analysis, Design Thinking, Product Improvement, Agile Methodology, Agile Project Management, DevOps",
                "Subcategory": "Design and Product",
                "Title": "Agile Development",
                "Type": "Specialization"
            }
        ]
    },
    {
        "input": {
            "skill": [
                "Javascript",
                "Angular",
                "React",
                "CSS",
                "Responsive Website Design"
            ],
            "category": [
                "IT & Engineering"
            ],
            "top_n": 10
        },
        "recommendations": [
            {
                "Category": "Computer Science",
                "Description": "This course is part of AI Engineering Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 2458,
                "Institution": "Scrimba",
                "Level": "Intermediate",
                "Modules Description": [
                    "In this module, you'll cover the foundational concepts of LangChain, setting up Supabase for data storage, and preparing text data for efficient processing.",
                    "It's time to start building! You'll create retrieval chains, design prompt templates, structure outputs, and optimize workflows using RunnableSequence().",
                    "Finally, you'll focus on integrating a user interface, managing memory, troubleshooting performance issues, and ensuring scalability in LangChain applications.",
                    "Put your knowledge to the test with this interactive graded quiz!"
                ],
                "Modules Duration": [
                    "33 minutes",
                    "39 minutes",
                    "23 minutes",
                    "33 minutes"
                ],
                "Modules Name": [
                    "Build AI apps with LangChain JS",
                    "Core Functionality & Processing",
                    "Challenges, UI, and Finalization",
                    "Test your knowledge!"
                ],
                "Rating": 4.7,
                "Similarity": 0.7918229699134827,
                "Skills": "User Interface (UI), Artificial Intelligence, Generative AI, Prompt Engineering, Scalability, Data Storage, Application Development, Application Performance Management, Maintainability, Databases",
                "Subcategory": "Software Development",
                "Title": "Build AI Apps with LangChain.js",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "Discover your JavaScript developer potential. Solidify your cloud application developer skills with essential JavaScript technologies and NoSQL databases",
                "Duration": "3 - 6 Months",
                "Enrolled": 5035,
                "Institution": "IBM",
                "Level": "Beginner",
                "Modules Description": [
                    "Describe JavaScript development concepts, list ES6 features, outline data structures, and explore arrays, DOM, AJAX, and debugging techniques.\nExplore handling errors and exceptions, functions and events, apply string manipulation and error-handing techniques, and traverse the DOM.\nCompare functions, values, reference types, and strategies in promises and async/await, and discuss modifying the appearance of DOM elements.\nEmploy JavaScript functions, services, tools, and libraries to create and style navigation and pages, and AJAX to fetch and display data from APIs.",
                    "Develop interactive user interfaces (UIs) and web applications using JavaScript technologies including React, JSX, and ES6.\nBuild dynamic front-end applications quickly and easily with reusable React components.\nEmploy various React concepts and features, including props, states, hooks, forms, and Redux.\nDemonstrate your React skills by building several front-end applications such as a shopping cart.",
                    "Create server-side applications using the Node.js JavaScript run time.Â\nExtend your Node.js applications with third-party packages and frameworks, including Express.Â\nUse npm to manage Node.js packages in your Node.js application.Â\nDevelop asynchronous callback functions and promises to complete asynchronous operations.  Â",
                    "Implement fundamental back-end development concepts with Node, Express, and NoSQL databases\nDevelop secure RESTful APIs using Node and Express to communicate with databases\nApply authentication and authorization mechanisms and implement error handling\nScale and deploy Node database applications on a cloud platform"
                ],
                "Modules Duration": [
                    "16 hours",
                    "14 hours",
                    "13 hours",
                    "19 hours"
                ],
                "Modules Name": [
                    "JavaScript Programming Essentials",
                    "Developing Front-End Apps with React",
                    "Developing Back-End Apps with Node.js and Express",
                    "Node.js & MongoDB: Developing Back-end Database Applications"
                ],
                "Rating": 4.4,
                "Similarity": 0.7772903442382812,
                "Skills": "Full-Stack Web Development, Node.JS, Database Development, Javascript, Web Applications, React.js, Debugging, NoSQL, Authentications, UI Components, React Redux, Server Side",
                "Subcategory": "Software Development",
                "Title": "JavaScript Programming with React, Node & MongoDB",
                "Type": "Specialization"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of Mathematics for Machine Learning and Data Science Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 166449,
                "Institution": "DeepLearning.AI",
                "Level": "Intermediate",
                "Modules Description": [
                    "Matrices are commonly used in machine learning and data science to represent data and its transformations. In this week, you will learn how matrices naturally arise from systems of equations and how certain matrix properties can be thought in terms of operations on system of equations.",
                    "In this week, you will learn how to solve a system of linear equations using the elimination method and the row echelon form. You will also learn about an important property of a matrix: the rank. The concept of the rank of a matrix is useful in computer vision for compressing images.",
                    "An individual instance (observation) of data is typically represented as a vector in machine learning. In this week, you will learn about properties and operations of vectors. You will also learn about linear transformations, matrix inverse, and one of the most important operations on matrices: the matrix multiplication. You will see how matrix multiplication naturally arises from composition of linear transformations. Finally, you will learn how to apply some of the properties of matrices and vectors that you have learned so far to neural networks.",
                    "In this final week, you will take a deeper look at determinants. You will learn how determinants can be geometrically interpreted as an area and how to calculate determinant of product and inverse of matrices.  We conclude this course with eigenvalues and eigenvectors. Eigenvectors are used in dimensionality reduction in machine learning. You will see how eigenvectors naturally follow from the concept of eigenbases."
                ],
                "Modules Duration": [
                    "8 hours",
                    "8 hours",
                    "9 hours",
                    "7 hours"
                ],
                "Modules Name": [
                    "Week 1: Systems of linear equations",
                    "Week 2: Solving systems of linear equations",
                    "Week 3: Vectors and Linear Transformations",
                    "Week 4: Determinants and Eigenvectors"
                ],
                "Rating": 4.6,
                "Similarity": 0.7767828702926636,
                "Skills": "Data Science, Data Manipulation, Jupyter, Python Programming, Linear Algebra, Dimensionality Reduction, Machine Learning, Machine Learning Methods, NumPy, Applied Mathematics, Artificial Intelligence",
                "Subcategory": "Algorithms",
                "Title": "Linear Algebra for Machine Learning and Data Science",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of UI Design for Web Developers Specialization",
                "Duration": "1 - 3 Months",
                "Enrolled": 0,
                "Institution": "Scrimba",
                "Level": "Intermediate",
                "Modules Description": [
                    "Learn the basics of using Figma and how to translate a design into a web project as you build a simple card.",
                    "With an emphasis on CSS you will work on the layout for a landing page that will look great on desktop and mobile.",
                    "Challenge yourself to create a data analytics dashboard using HTML and CSS.",
                    "Bring another Figma layout to life on the web, adding complexity and detail to desktop and mobile views.",
                    "Build your most complex layout yet tying in all the concepts you've learned through the course."
                ],
                "Modules Duration": [
                    "43 minutes",
                    "41 minutes",
                    "55 minutes",
                    "48 minutes",
                    "1 hour"
                ],
                "Modules Name": [
                    "Welcome & First Project - Simple Card",
                    "Simple Landing Page",
                    "Data Analytics Dashboard",
                    "Car Sales Site",
                    "Drone Event Landing Page"
                ],
                "Rating": 4.4,
                "Similarity": 0.7497748732566833,
                "Skills": "Wireframing, Usability, Prototyping, HTML and CSS, User Interface (UI) Design, Mockups, Front-End Web Development, Web Development, Responsive Web Design, Web Design and Development, Web Content Accessibility Guidelines, Web Design, Figma (Design Software), Javascript",
                "Subcategory": "Software Development",
                "Title": "Build Websites with Figma, HTML, and CSS",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "No Description",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Coursera Instructor Network",
                "Level": "Intermediate",
                "Modules Description": [
                    "In this course, you'll learn how to build sleek, responsive, and accessible web applications using Angular 11+ and Angular Material UI. Through hands-on projects, practical walkthroughs, and real-world examples, you'll master how to integrate Material Design components into your Angular apps, customize themes, and optimize UI performance. Whether you're creating enterprise dashboards or modern admin panels, this course gives you the tools to deliver polished, scalable, and high-performing user interfaces."
                ],
                "Modules Duration": [
                    "3 hours"
                ],
                "Modules Name": [
                    "Angular 11+ & Material UI: Build Responsive Web Apps"
                ],
                "Rating": "No rating",
                "Similarity": 0.714728593826294,
                "Skills": "Cascading Style Sheets (CSS), Performance Tuning, Responsive Web Design, Angular, UI Components, HTML and CSS, Usability, Web Applications, JavaScript Frameworks, Front-End Web Development, User Interface (UI), User Interface and User Experience (UI/UX) Design, TypeScript, Scalability, Web Design",
                "Subcategory": "Mobile and Web Development",
                "Title": "Angular 11+ & Material UI: Build Responsive Web Apps",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "Learn the Essentials of Web Development and Design. Build your skills in web development and design, learn advanced features of web fonts, explore the history of layout on the web, and review new approaches for designers and developers.",
                "Duration": "3 - 6 Months",
                "Enrolled": 1723,
                "Institution": "University of California, Davis",
                "Level": "Beginner",
                "Modules Description": [
                    "This course is designed to build your skills in web development and design, no matter how little experience or technical knowledge you currently have. You probably visit several websites every day, whether for business, entertainment or education. But have you ever wondered how these websites actually work? How are they built? How do browsers, computers, and mobile devices interact with the web? What skills are necessary to build a website? With a billion websites now on the internet, the answers to these questions could be your first step toward a better understanding of the internet and developing a new set of internet skills.\nBy the end of this course you'll be able to describe the structure and functionality of the world wide web, create static web pages using HTML and CSS, select an appropriate web hosting service, and publish your webpages for the world to see. Finally, you'll be able to develop a working model for creating your own personal or business websites in the future and launch yourself on a learning journey in web development.",
                    "In this course, you'll learn how type communicates and how styling and organization of written content affects the message. You'll look at advanced features of web fonts and see how type designers are taking the fields of digital type to the next level. Then, you'll learn about color, color theory, and the practice of using color in your digital products and work with color by exploring gradients, other effects, and work to create a website using techniques learned in this course. Finally, we'll wrap up the course by learning how to create animations in CSS using transitions, 2d and 3d transformations, as well as keyframes to create sophisticated animations on the web.",
                    "In this course, we'll explore the history of layout on the web and techniques that have been used to create those layouts. You'll practice using Flexbox CSS and gain an understanding of how Flexbox works to create layouts for web pages. We'll practice using responsive web design and discuss the challenges of managing layouts across multiple screen sizes. You'll learn specific techniques to build a responsive web page and practice using mobile first development. Lastly, you'll apply the techniques learned in this course by using Flexbox properties to create a mini portfolio website and deploy it on GitHub.",
                    "Different ways designers and developers can create and control the flow of content on web pages.\nAdvanced uses of CSS grid and creative ways to implement grid on websites.\nAdvanced features of CSS Flexbox properties, controlling the use of space in a row or a column, positioning, and techniques to create web layouts."
                ],
                "Modules Duration": [
                    "10 hours",
                    "10 hours",
                    "16 hours",
                    "9 hours"
                ],
                "Modules Name": [
                    "Introduction to Web Development",
                    "Beyond Basic CSS: Typography, Color, Effects, & Animation",
                    "Creating Basic Web Layouts",
                    "Advanced Web Layouts"
                ],
                "Rating": 4.7,
                "Similarity": 0.6991918087005615,
                "Skills": "HTML and CSS, Web Content Accessibility Guidelines, Design Elements And Principles, Animations, Web Applications, Web Content, GitHub, Version Control, Hypertext Markup Language (HTML), User Interface (UI) Design, Application Deployment, Typography",
                "Subcategory": "Mobile and Web Development",
                "Title": "Web Development for Beginners",
                "Type": "Specialization"
            },
            {
                "Category": "Information Technology",
                "Description": "CompTIA A+ Core 2 Certification with IT Skills. Prepare for the CompTIA A+ Core 2 (220-1102) exam by mastering key IT skills in operating systems, security, troubleshooting, and IT operations. Gain hands-on knowledge to pass your certification and excel in an IT support role.",
                "Duration": "3 - 6 Months",
                "Enrolled": 0,
                "Institution": "Packt",
                "Level": "Beginner",
                "Modules Description": [
                    "Identify the core components of computer hardware and mass storage.\nImplement partitioning schemes and configure file systems for different operating systems.\nDiagnose and troubleshoot issues with various operating systems.\nDevelop professional communication strategies and safety protocols for IT environments.",
                    "Describe how user accounts, permissions, and system security differ across various platforms.\nConfigure and troubleshoot networks using tools such as DNS, DHCP, and firewalls.\nCompare and diagnose network issues related to system performance across multiple operating systems.\nAssess system performance and backup strategies to optimize data protection across operating systems.",
                    "Manage and optimize mobile devices by configuring email and troubleshooting common mobile issues.\nDiagnose and troubleshoot wireless connectivity issues and assess enterprise-grade wireless solutions for performance and security.\nEvaluate IT operational procedures such as backups, data destruction, and documentation management for efficiency and compliance.\nDevelop comprehensive IT operational controls, using ticketing systems to ensure smooth enterprise IT operations."
                ],
                "Modules Duration": [
                    "5 hours",
                    "11 hours",
                    "7 hours"
                ],
                "Modules Name": [
                    "Foundations of Computer Hardware and Storage",
                    "Operating Systems and Networking Fundamentals",
                    "Advanced Networking, Security, and IT Operations"
                ],
                "Rating": 4.7,
                "Similarity": 0.6991538405418396,
                "Skills": "Threat Detection, Network Security, Mobile Security, Wireless Networks, Hardware Troubleshooting, Command-Line Interface, Software Installation, TCP/IP, Computer Hardware, Peripheral Devices, Linux, Operating Systems",
                "Subcategory": "Data Management",
                "Title": "CompTIA A+ Certification Core 2 (220-1102)",
                "Type": "Specialization"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of Responsive Website Development and Design Specialization",
                "Duration": "1 - 3 Months",
                "Enrolled": 36811,
                "Institution": "University of London",
                "Level": "Mixed",
                "Modules Description": [
                    "Welcome to the first module of 'Responsive Website Tutorial and Examples!'. In this session we will be exploring a real-world web development task based on a common brief that web developers have to respond to every day – producing a portfolio website with both static and dynamic content features. I hope you enjoy the module! -Mick",
                    "Welcome to the second module of 'Responsive Website Tutorial and Examples!'. Meteor is great at making collaboration simple. You can make collaborative sites in a day or so that work across many devices including mobile. By the end of this session you will understand how to structure and build collaborative, real-time applications, how to integrate the web audio API, and how to specifically set and get variables stored in the database using basic interface elements.",
                    "Welcome to the third module of 'Responsive Website Tutorial and Examples!'.Meteor allows us to make creative, collaborative apps that work in real-time. Both the Client and the Server can insert information into a Mongo collection. Ordinary web users can do this interactively, without having to program the database manually. In this session we will look at this approach through the lens of collaborative drawing. You will learn how to create a canvas using d3.js, change attributes of the canvas, create client code for inserting data into the database and how to render database entries as a drawing.",
                    "Welcome to the final module of 'Responsive Website Tutorial and Examples!'.In this session we will be looking at how to use data from external sources to create interactive  visualisations for the purposes of creating an interactive data visualisation web app.",
                    ""
                ],
                "Modules Duration": [
                    "50 minutes",
                    "6 hours",
                    "7 hours",
                    "6 hours",
                    "6 hours"
                ],
                "Modules Name": [
                    "Responsive Website Tutorials and Examples outline: Course overview",
                    "Creating a Portfolio Website with a Blog",
                    "Collaborative Apps 1 : Music Machine",
                    "Collaborative Apps 2 : Drawing Machine",
                    "Creating a Data Visualisation Application"
                ],
                "Rating": 4.2,
                "Similarity": 0.6902991533279419,
                "Skills": "JavaScript Frameworks, Interactive Data Visualization, Collaborative Software, Real Time Data, Responsive Web Design, Front-End Web Development, Web Applications, Databases, User Requirements Documents, User Interface (UI) Design, Full-Stack Web Development, Data Integration",
                "Subcategory": "Mobile and Web Development",
                "Title": "Responsive Website Tutorial and Examples",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "No Description",
                "Duration": "3 - 6 Months",
                "Enrolled": 4324,
                "Institution": "INSEAD",
                "Level": "Beginner",
                "Modules Description": [
                    "How blockchain works, and how trust is established in a pre- and post-blockchain world\nNine types of digital assets, including cryptocurrencies, protocol tokens, NFTs, stablecoins, securities tokens, governance tokens, and CBDCs\nWhat smart contracts are, the phases of a smart contract deal cycle, and various examples and applications of smart contracts\nBlockchain design principles, and challenge areas associated with implementing blockchain technology",
                    "The roles of key participants in the global trade network and where the needs of each participant align with the value characteristics of blockchain\nWhat it means to \"tokenize\" an asset, and approaches to securing the physical-digital interface\nExamples of sensor-based logistics, and IoT challenge areas that show promise for blockchain-based solutions\nBlockchain solutions for provenance, traceability, ethical sourcing, and asset life-cycle management",
                    "Describe how blockchain consortia may vary with respect to their purpose, activities, membership models, beneficiaries, and governance models\nDescribe some of the benefits and key considerations concerning shared standards for blockchain and digital assets\nExplain how blockchain design choices around privacy, user identity, security, notaries, block relays etc. influence interoperability implementations\nExplain how blockchain will transform the roles and functions of the C-Suite",
                    "Identify new ideas or opportunities for blockchain within Global Commerce\nExplain how you will position your idea, including how your idea will create new value for your customers\nIdentify the business model decisions that would need to be made in order to assess the feasibility of your idea\nDescribe what would need to change in your organization's current way of operating in order to bring your idea to fruition"
                ],
                "Modules Duration": [
                    "33 hours",
                    "12 hours",
                    "23 hours",
                    "12 hours"
                ],
                "Modules Name": [
                    "Introduction to Blockchain for Global Commerce",
                    "Web3 and Blockchain Transformations in Global Supply Chains",
                    "Web3 and Blockchain Leadership for Transformation",
                    "Blockchain Opportunity Analysis for Global Commerce"
                ],
                "Rating": 4.7,
                "Similarity": 0.6845800876617432,
                "Skills": "Logistics, Governance, Supply Chain, Supply Chain Management, FinTech, Market Analysis, Interoperability, Digital Assets, Leadership, Business Analysis, Transportation, Supply Chain, and Logistics, Proposal Development",
                "Subcategory": "Computer Security and Networks",
                "Title": "Web3 and Blockchain in Global Commerce",
                "Type": "Specialization"
            },
            {
                "Category": "Information Technology",
                "Description": "This course is part of Introduction to Generative AI Learning Path Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 981116,
                "Institution": "Google Cloud",
                "Level": "Beginner",
                "Modules Description": [
                    "This is an introductory level microlearning course aimed at explaining what Generative AI is, how it is used, and how it differs from traditional machine learning methods. It also covers Google Tools to help you develop your own Gen AI apps."
                ],
                "Modules Duration": [
                    "1 hour"
                ],
                "Modules Name": [
                    "Introduction to Generative AI"
                ],
                "Rating": 4.7,
                "Similarity": 0.6809689402580261,
                "Skills": "Artificial Intelligence, Application Development, Machine Learning Methods, Generative AI, Google Cloud Platform",
                "Subcategory": "Cloud Computing",
                "Title": "Introduction to Generative AI",
                "Type": "Course"
            }
        ]
    },
    {
        "input": {
            "skill": [
                "Pay-Per-Click Advertising",
                "Google Ads",
                "Ad Copywriting",
                "Traffic Source Analysis",
                "Bounce Rate",
                "Marketing Strategy",
                "Content Marketing"
            ],
            "category": [
                "Marketing & Social Media"
            ],
            "top_n": 10
        },
        "recommendations": [
            {
                "Category": "Business",
                "Description": "This course is part of Foundations of Digital Marketing Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "University of Maryland, College Park",
                "Level": "Beginner",
                "Modules Description": [
                    "In the first module, we will introduce you to the course and the objectives. You'll have the opportunity to meet your instructor, connect with your peers, and get familiar with the Coursera platform and support resources. We will dive into the transformative role of machine learning and artificial intelligence in digital marketing and gain insights into how these technologies can help automate marketing processes, predict customer behavior, and optimize decision-making. We'll also explore practical applications of AI, such as improving customer segmentation and enhancing personalized marketing strategies to drive measurable business outcomes.",
                    "In this module, we're going to introduce Big Data and Artificial Intelligence.  We'll also look at how marketers use rich data and enhanced analytical capacity to move from qualitative to quantitative analytical data, from data to big data, and from machine learning to deep learning AI to better understand and market to consumers.",
                    "Congratulations! You've made it to the end of the course. As a final assessment, it's time to apply your learning."
                ],
                "Modules Duration": [
                    "2 hours",
                    "1 hour",
                    "12 minutes"
                ],
                "Modules Name": [
                    "Introduction to Digital Marketing Tools: Machine Learning and Artificial Intelligence",
                    "Big Data and Artificial Intelligence",
                    "End-of-Course Evaluation"
                ],
                "Rating": "No rating",
                "Similarity": 0.8384096622467041,
                "Skills": "Marketing Strategies, Machine Learning, Artificial Neural Networks, Predictive Analytics, Marketing Automation, Big Data, Deep Learning, Marketing Analytics, Customer Insights, Artificial Intelligence, Marketing, Digital Marketing, Apache Hadoop, Machine Learning Methods, Machine Learning Algorithms",
                "Subcategory": "Marketing",
                "Title": "Digital Marketing Tools: Machine Learning and AI",
                "Type": "Course"
            },
            {
                "Category": "Business",
                "Description": "No Description",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Coursera",
                "Level": "Beginner",
                "Modules Description": [
                    "You don't need fancy gear to create great YouTube videos—you need the right techniques. In this course, you'll learn how to dramatically improve the look and sound of your videos using just your smartphone and everyday items. From lighting and framing to clear audio and background music, you'll explore the simple production fundamentals that boost viewer engagement. Through a tutorial and hands-on practice, you'll experiment with different setups, evaluate your results, and walk away ready to record videos that look polished and professional."
                ],
                "Modules Duration": [
                    "48 minutes"
                ],
                "Modules Name": [
                    "YouTube Production: Video Fundamentals"
                ],
                "Rating": "No rating",
                "Similarity": 0.7578439712524414,
                "Skills": "Music, Post-Production, Photo/Video Production and Technology, Videography, Video Production",
                "Subcategory": "Marketing",
                "Title": "YouTube Production: Video Fundamentals",
                "Type": "Course"
            },
            {
                "Category": "Business",
                "Description": "No Description",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 2947,
                "Institution": "Simplilearn",
                "Level": "Beginner",
                "Modules Description": [
                    "This Affiliate Marketing course provides a complete journey to generate passive income and grow your online business. Learn the fundamentals of affiliate marketing, including key players, tracking methods, and payment models. Master top platforms like Amazon Associates and ShareASale, and build relationships with affiliate partners. Discover promotion methods using email, social media, and blogs to boost conversions and maximize earnings. Streamline your workflow by tracking affiliate links, analyzing data, and managing payouts. Stay ahead by exploring future trends in affiliate marketing to optimize performance and revenue. \n\nPerfect for bloggers, marketers, influencers, and entrepreneurs aiming to monetize their online presence.",
                    "This Affiliate Marketing course provides a complete journey to generate passive income and grow your online business. Learn the fundamentals of affiliate marketing, including key players, tracking methods, and payment models. Master top platforms like Amazon Associates and ShareASale, and build relationships with affiliate partners. Discover promotion methods using email, social media, and blogs to boost conversions and maximize earnings. Streamline your workflow by tracking affiliate links, analyzing data, and managing payouts. Stay ahead by exploring future trends in affiliate marketing to optimize performance and revenue. Perfect for bloggers, marketers, influencers, and entrepreneurs aiming to monetize their online presence."
                ],
                "Modules Duration": [
                    "1 hour",
                    "2 hours"
                ],
                "Modules Name": [
                    "Affiliate Marketing",
                    "Assessment for Affiliate Marketing"
                ],
                "Rating": 4.8,
                "Similarity": 0.7561224102973938,
                "Skills": "Market Trend, Relationship Building, Marketing Analytics, Marketing, Promotional Strategies, Marketing Strategies, Web Analytics and SEO, Trend Analysis, Performance Analysis, Marketing Channel, Social Media Marketing, Email Marketing, Blogs, Product Promotion, Content Marketing, Strategic Partnership",
                "Subcategory": "Marketing",
                "Title": "Affiliate Marketing Course",
                "Type": "Course"
            },
            {
                "Category": "Business",
                "Description": "This course is part of Machine Learning for Marketing Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "University of Maryland, College Park",
                "Level": "Beginner",
                "Modules Description": [
                    "In the first module, we will introduce you to the course and the objectives. You'll have the opportunity to meet your instructor, connect with your peers, and get familiar with the Coursera platform and support resources. We'll also explore the strategies for optimizing search engine visibility, analyzing the performance of paid search campaigns, and leveraging web analytics to track and improve digital marketing effectiveness.",
                    "In this module, we will start with an exploration into Online Testing.  Many managerial decisions are made based on professional knowledge and intuition, but often this knowledge is not sufficient enough to make the optimal decision. That's where testing comes in. Next, we will talk about Recommendation Systems. You may not realize it, but your internet experience is defined by recommendation systems. From music, games, videos, films, and what to buy, recommendation systems predict your preferences to suggest products or services that are likely to be of interest to you.",
                    "Congratulations! You've made it to the end of the course. As a final assessment, it's time to apply your learning."
                ],
                "Modules Duration": [
                    "2 hours",
                    "1 hour",
                    "10 minutes"
                ],
                "Modules Name": [
                    "Introduction to Digital Marketing Analytics",
                    "Online Testing and Recommendation Systems",
                    "End-of-Course Evaluation"
                ],
                "Rating": 4.8,
                "Similarity": 0.7462112307548523,
                "Skills": "Analytics, Machine Learning, A/B Testing, Digital Marketing, Marketing Analytics, Big Data, Predictive Analytics, Pay Per Click Advertising, Data-Driven Decision-Making, Web Analytics, Keyword Research, Online Advertising, Search Engine Optimization, Contextual Advertising, Key Performance Indicators (KPIs), Marketing Effectiveness, Customer Analysis, Data Analysis, Search Engine Marketing, Customer Data Management",
                "Subcategory": "Marketing",
                "Title": "Digital Marketing Analytics",
                "Type": "Course"
            },
            {
                "Category": "Business",
                "Description": "This course is part of IBM Digital Marketing and Growth Hacking Professional Certificate",
                "Duration": "1 - 3 Months",
                "Enrolled": 0,
                "Institution": "IBM",
                "Level": "Beginner",
                "Modules Description": [
                    "This module provides a foundational understanding of search engine optimization (SEO), covering key concepts and ranking factors. Explore the core components of SEO—on-page, off-page, content, and technical SEO. You will also explore how search engines crawl, index, and rank websites and the best practices for optimizing web pages. This module also introduces you to Google Artificial Intelligence Optimization (AIO) and growth hacking in SEO. The module also introduces how to optimize on-page SEO elements such as keyword research, meta descriptions, page titles, and content structuring to enhance visibility on search engine results pages (SERPs). By the end of this module, you'll be equipped with the knowledge, tools, and strategies to enhance search performance and boost website traffic.",
                    "This module introduces off-page SEO and its role in improving search engine rankings. You will learn about the importance of domain authority, backlink strategies, and the impact of external signals, such as social media and online reputation, on SEO performance. The module provides practical insights into building high-quality backlinks, leveraging guest posting, and identifying authoritative sites for link-building opportunities. On completing this module, you will be equipped with the necessary foundational knowledge of off-page SEO and link-building. Further in this module, you will explore techniques of growth hacking that can be applied in off-page SEO.",
                    "This module provides an in-depth understanding of technical SEO, focusing on essential concepts such as crawling, indexing, website speed, and mobile responsiveness—the key factors in enhancing user experience and search visibility. You'll learn to conduct technical SEO audits using third-party tools, implement schema markup and rich snippets, and leverage structured data to improve content visibility. Additionally, you'll gain knowledge of SEO analytics, learning how to interpret data from Google Search Console (GSC) and Google Analytics (GA) to make data-driven decisions that enhance SEO performance.",
                    "This module covers the role of content marketing as a critical component of SEO. You will explore the fundamentals of content marketing, including its role in building brand authority and engaging audiences. The module also covers content distribution strategies, marketing approaches, and best practices for creating high-quality, shareable content that improves search visibility and drives traffic. Further, this module covers techniques and methods to leverage growth hacking principles for content marketing.",
                    "The module includes a final project based on the concepts covered in the course. In this module, you will also attempt a graded quiz to test and reinforce your understanding of concepts."
                ],
                "Modules Duration": [
                    "3 hours",
                    "2 hours",
                    "3 hours",
                    "3 hours",
                    "2 hours"
                ],
                "Modules Name": [
                    "Introduction to SEO and On-Page Optimization",
                    "Off-Page SEO and Link-Building",
                    "Technical SEO and Analytics",
                    "Content Marketing",
                    "Assessment and Final Project "
                ],
                "Rating": "No rating",
                "Similarity": 0.7381552457809448,
                "Skills": "Search Engine Optimization, Content Development and Management, Web Analytics, Blogs, Growth Strategies, Search Engine Marketing, Digital Marketing, Content Creation, Marketing Strategy and Techniques, Content Strategy, Web Analytics and SEO, MarTech, Market Research, Content Marketing",
                "Subcategory": "Marketing",
                "Title": "Search Engine Optimization and Content Marketing",
                "Type": "Course"
            },
            {
                "Category": "Business",
                "Description": "No Description",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Coursera",
                "Level": "Beginner",
                "Modules Description": [
                    "Learn how to create engaging Instagram Reels that boost visibility and connect with your audience. This lesson covers the essentials of video production and editing using Instagram's native tools, with a focus on timing, transitions, and visual effects. You'll also explore how to select and synchronize audio, including tips for using trending sounds and navigating copyright considerations. Through a guided tutorial and a hands-on activity, you'll plan, film, and publish your first Reel with confidence."
                ],
                "Modules Duration": [
                    "48 minutes"
                ],
                "Modules Name": [
                    "Creating Instagram Reels & Video Content"
                ],
                "Rating": "No rating",
                "Similarity": 0.733197033405304,
                "Skills": "Instagram, Content Creation, Drive Engagement, Video Editing, Video Production, Media Production",
                "Subcategory": "Marketing",
                "Title": "Instagram Reels: Create Engaging Videos",
                "Type": "Course"
            },
            {
                "Category": "Business",
                "Description": "No Description",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Coursera",
                "Level": "Beginner",
                "Modules Description": [
                    "Learn how to build and manage a sustainable Facebook content plan that supports your goals and engages your audience consistently. This course walks you through creating a strategic content calendar, balancing planned and reactive posts, and using tools like Google Sheets and Meta Business Suite for scheduling and performance tracking. You'll explore content mix strategies, optimal posting times, and workflow tips to streamline your content production. Through a hands-on planning activity and expert guidance, you'll develop a reliable system to reduce content stress and improve long-term engagement on Facebook."
                ],
                "Modules Duration": [
                    "45 minutes"
                ],
                "Modules Name": [
                    "Facebook Planning: Manage Content Like a Pro"
                ],
                "Rating": "No rating",
                "Similarity": 0.7305079698562622,
                "Skills": "Facebook, Scheduling, Workflow Management, Content Performance Analysis, Calendar Management, Drive Engagement, Social Media, Google Workspace, Content Management, Content Strategy, Live Streaming, Social Media Content, Content Creation, Social Media Management",
                "Subcategory": "Marketing",
                "Title": "Facebook Planning: Manage Content Like a Pro",
                "Type": "Course"
            },
            {
                "Category": "Business",
                "Description": "No Description",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Coursera",
                "Level": "Beginner",
                "Modules Description": [
                    "Discover how to create compelling YouTube Shorts that capture attention and grow your channel. This course covers the technical requirements, platform-specific strategies, and content planning techniques to help you produce short-form videos that complement your long-form content. You'll learn how to use tools like CapCut, spot trends, and optimize for retention and reach. By the end, you'll be able to design Shorts that engage viewers and expand your audience through consistent, impactful storytelling."
                ],
                "Modules Duration": [
                    "48 minutes"
                ],
                "Modules Name": [
                    "YouTube Shorts: Create Winning Content"
                ],
                "Rating": "No rating",
                "Similarity": 0.727808952331543,
                "Skills": "Video Production, Storytelling, Photo/Video Production and Technology, Video Editing, Content Creation, Content Strategy, Drive Engagement",
                "Subcategory": "Marketing",
                "Title": "YouTube Shorts: Create Winning Content",
                "Type": "Course"
            },
            {
                "Category": "Business",
                "Description": "No Description",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Coursera",
                "Level": "Beginner",
                "Modules Description": [
                    "Explore how to use Instagram Stories to boost engagement and build stronger connections with your audience. This course covers interactive tools like polls, questions, and quizzes, and shows how to use them strategically to encourage participation and gather feedback. You'll also learn to optimize Stories with hashtags, mentions, and location tags to increase visibility. With expert tips, a hands-on activity, and a tutorial demonstrating Stories techniques, you'll be ready to create impactful, interactive Stories that reflect your brand."
                ],
                "Modules Duration": [
                    "47 minutes"
                ],
                "Modules Name": [
                    "Instagram Stories and Interactive Features"
                ],
                "Rating": "No rating",
                "Similarity": 0.7259864211082458,
                "Skills": "Content Creation, Instagram, Storytelling, User Feedback, Drive Engagement, Brand Strategy, Social Media, Social Media Marketing",
                "Subcategory": "Marketing",
                "Title": "Instagram Stories: Maximize Interaction",
                "Type": "Course"
            },
            {
                "Category": "Business",
                "Description": "No Description",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Coursera",
                "Level": "Beginner",
                "Modules Description": [
                    "Learn how Instagram's algorithm shapes what content users see—and how to work with it instead of against it. This lesson explores key algorithm signals, best practices for boosting visibility, and real-world strategies used by top creators. You'll analyze successful posts to identify hooks, engagement tactics, and calls to action, then apply those insights to your own content. By the end, you'll have a clear understanding of how to create posts that perform better and reach more of your audience."
                ],
                "Modules Duration": [
                    "46 minutes"
                ],
                "Modules Name": [
                    "Understanding Instagram's Algorithm"
                ],
                "Rating": "No rating",
                "Similarity": 0.7252938151359558,
                "Skills": "Social Media, Content Strategy, Social Media Content, Customer Engagement, Content Performance Analysis, Content Creation, Digital Media Strategy, Content Marketing, Drive Engagement, Instagram, Social Media Strategy",
                "Subcategory": "Marketing",
                "Title": "Instagram Insights: Crack the Algorithm",
                "Type": "Course"
            }
        ]
    },
    {
        "input": {
            "skill": [
                "Predictive Modeling",
                "Python",
                "Scikit-learn",
                "NumPy",
                "Unsupervised Learning",
                "Clustering"
            ],
            "category": [
                "Data & Product",
                "IT & Engineering"
            ],
            "top_n": 10
        },
        "recommendations": [
            {
                "Category": "Information Technology",
                "Description": "This course is part of Python for Cybersecurity Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 5201,
                "Institution": "Infosec",
                "Level": "Intermediate",
                "Modules Description": [
                    "Explore Python command-and-control",
                    "Explore the uses of Python for data exfiltration",
                    "Explore the details of using Python for attack and exfiltration"
                ],
                "Modules Duration": [
                    "1 hour",
                    "1 hour",
                    "1 hour"
                ],
                "Modules Name": [
                    "Python for command-and-control",
                    "Python for exfiltration",
                    "Python for impact"
                ],
                "Rating": 4.7,
                "Similarity": 0.6912496089935303,
                "Skills": "Encryption, Scripting, Command-Line Interface, Threat Modeling, Incident Response, Threat Detection, Python Programming, Network Analysis, Cyber Operations, Cybersecurity",
                "Subcategory": "Security",
                "Title": "Python for Command-and-control, Exfiltration and Impact",
                "Type": "Course"
            },
            {
                "Category": "Data Science",
                "Description": "Build Expertise in Data Analytics and Big Data. Gain expertise in relational databases and big data technologies to manage datasets.",
                "Duration": "3 - 6 Months",
                "Enrolled": 0,
                "Institution": "Illinois Tech",
                "Level": "Intermediate",
                "Modules Description": [
                    "Describe what relational databases are, and how they are used.\nMaster the Relational Database Model.\nDemonstrate comprehensive SQL skills.",
                    "Describe the process and the design aspects involved in relational database design.\nDevelop entity-relationship diagrams using basic and extended Entity-relationship features in relational design.\nIdentify and apply normalization techniques.",
                    "Implement relational database and usage of indexes, views, triggers, temporary tables, functions, and stored procedures.\nDevelop database-driven applications using programming languages, such as Java, Python or C/C++ and frameworks.\nDescribe transaction and concurrency control concepts in relational databases.",
                    "1. Apply appropriate techniques for generating insights from data.2. Present actionable solutions with confidence to the business stakeholders.",
                    "Understanding and identifying  use cases and domains of Big Data problems\nSelecting and implementing technical solutions involving Big Data systems\nDevelop and use various open source software systems (Apache) in the Big Data tech stack\nOperate and run various cloud computing software services (AWS) in the Big Data infrastructure space"
                ],
                "Modules Duration": [
                    "48 hours",
                    "47 hours",
                    "30 hours",
                    "79 hours",
                    "97 hours"
                ],
                "Modules Name": [
                    "Introduction to Relational Databases",
                    "Relational Database Design",
                    "Relational Database Implementation and Applications",
                    "Data Preparation and Analysis",
                    "Big Data Technologies"
                ],
                "Rating": 4.4,
                "Similarity": 0.6901388168334961,
                "Skills": "Database Theory, Database Design, Apache Hadoop, Database Management Systems, Database Application, Database Management, Database Development, Data Visualization, Statistical Analysis, Exploratory Data Analysis, Big Data, NoSQL",
                "Subcategory": "Data Analysis",
                "Title": "Data Analytics and Big Data",
                "Type": "Specialization"
            },
            {
                "Category": "Information Technology",
                "Description": "This course is part of IBM Relational Database Administrator Professional Certificate",
                "Duration": "1 - 3 Months",
                "Enrolled": 0,
                "Institution": "IBM",
                "Level": "Advanced",
                "Modules Description": [
                    "In this module, you will design a data platform that uses MySQL as an OLTP database. You will be using MySQL to store the OLTP data.",
                    "In this module, you will design and implement a data warehouse and you will then generate reports from the data in the data warehouse.",
                    "In this module, you will use the given Python script to perform various ETL operations that load the data warehouse with the required information. You will also write a pipeline that analyzes the web server log file, extracts the required lines and fields, transforms and loads data.",
                    "In this module, you will perform back-up and restore operations on the database. You will also implement automation to streamline database management processes.",
                    "In this module, you will optimize the query performance and memory utilization of your database. You will also implement data security protocols, including user access management strategies and data encryption.",
                    "In this module, you will organize and submit your project deliverables for final evaluation. This module guides you through the submission process and outlines the criteria for assessing your work."
                ],
                "Modules Duration": [
                    "1 hour",
                    "3 hours",
                    "2 hours",
                    "3 hours",
                    "3 hours",
                    "1 hour"
                ],
                "Modules Name": [
                    "Data Platform Architecture and OLTP Database",
                    "Build a Data Warehouse",
                    "ETL and Data Pipelines",
                    "Backup, Restore, and Automation",
                    "Database Optimization, Security, and Access Management",
                    "Final Submission"
                ],
                "Rating": 4.8,
                "Similarity": 0.6869876384735107,
                "Skills": "Data Pipelines, Data Architecture, SQL, Database Design, Disaster Recovery, Performance Tuning, MySQL, Operational Databases, Data Security, Database Administration, PostgreSQL, Apache Airflow, Database Architecture and Administration, Extract, Transform, Load, Data Warehousing, Database Management",
                "Subcategory": "Data Management",
                "Title": "Relational Database Administration Capstone Project",
                "Type": "Course"
            },
            {
                "Category": "Information Technology",
                "Description": "This course is part of Artificial Intelligence: an Overview Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 7453,
                "Institution": "Politecnico di Milano",
                "Level": "Beginner",
                "Modules Description": [
                    "",
                    "",
                    ""
                ],
                "Modules Duration": [
                    "1 hour",
                    "50 minutes",
                    "51 minutes"
                ],
                "Modules Name": [
                    "Week 1 - Supervised Learning",
                    "Week 2 - Unsupervised Learning",
                    "Week 3 - Reinforcement Learning"
                ],
                "Rating": 4.6,
                "Similarity": 0.6333565711975098,
                "Skills": "Classification And Regression Tree (CART), Applied Machine Learning, Algorithms, Machine Learning, Dimensionality Reduction, Machine Learning Algorithms, Supervised Learning, Reinforcement Learning, Data Mining, Regression Analysis, Unsupervised Learning",
                "Subcategory": "Data Management",
                "Title": "Machine Learning: an overview",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "No Description",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Northeastern University",
                "Level": "Beginner",
                "Modules Description": [
                    "In this module, you'll learn the essential principles of HTML and gain a solid foundation in web development. You'll be introduced to semantic HTML, learning to identify and define semantic elements that improve accessibility. This module also covers common industry practices for casing and indentation, ensuring your code is clean and maintainable. By the end of this module, you'll be able to recognize key characteristics of HTML styles, use semantic elements effectively, and apply best practices in structuring your code. These skills will serve as a foundation for creating well-organized, accessible web pages.",
                    "In this module, you'll explore the essentials of HTML syntax and the importance of semantic HTML. We'll start by covering basic HTML syntax and structure, including the use of hyperlinks and proper casing. You'll also learn more about DevTools to understand HTML elements better. Moving forward, we'll delve into semantic HTML, which enhances accessibility and SEO by using meaningful tags like `<header>`, `<footer>`, and `<article>`. By the end of this module, you'll grasp how structured, semantic HTML can improve both the functionality and readability of your web pages.",
                    "In this module, you'll dive into the core principles of CSS and how it shapes web design. We'll start with the basics of CSS syntax and explore fundamental concepts such as selectors, pseudo-classes, and pseudo-elements. You'll learn to manage styles using type, class, and ID selectors, and understand how to effectively load and apply CSS to your web pages. Additionally, we'll cover the CSS Box Model and its impact on layout, including inline, block, and inline-block elements. By the end of this module, you'll have a solid foundation in CSS to enhance your web pages with custom styles and layouts.",
                    "This module you will complete a final assignment. The goal of this assignment is to create a semantic, valid HTML page listing \"My Favorite Cats\" using the knowledge from the provided course materials. Ensure that your HTML follows best practices for semantics, structure, and accessibility."
                ],
                "Modules Duration": [
                    "3 hours",
                    "3 hours",
                    "4 hours",
                    "3 hours"
                ],
                "Modules Name": [
                    "HTML Fundamentals",
                    "HTML Syntax and Semantic HTML",
                    "CSS Fundamentals",
                    "My Favorite Cats"
                ],
                "Rating": "No rating",
                "Similarity": 0.6289799213409424,
                "Skills": "Javascript, Cascading Style Sheets (CSS), HTML and CSS, Semantic Web, Command-Line Interface, Web Development Tools, Web Design and Development, React.js, Web Servers, User Interface (UI), Front-End Web Development, Responsive Web Design",
                "Subcategory": "Mobile and Web Development",
                "Title": "Comprehensive UX and Responsive Web Design",
                "Type": "Course"
            },
            {
                "Category": "Data Science",
                "Description": "This course is part of Tableau Data Analyst Certification Preparation Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "SkillUp EdTech",
                "Level": "Advanced",
                "Modules Description": [
                    "In this module, you will learn about the eligibility requirements for the Tableau Data Analyst Certification exam, including education, experience, costs, and the exam registration process. You'll discover the four domains on which the exam is based and the percentage of questions in the exam from each domain. You will be equipped with study resources and tips to prepare for the exam, and you will have the opportunity to take a short practice test to check your preparedness for the exam.",
                    "This module will present you with a timed mock exam that simulates the certification questions. After completing this module, you can evaluate if you are ready for the exam or should engage in more practice activities before taking the exam."
                ],
                "Modules Duration": [
                    "1 hour",
                    "2 hours"
                ],
                "Modules Name": [
                    "About the Tableau Certified Data Analyst Exam",
                    "Tableau Certified Data Analyst Mock Exam"
                ],
                "Rating": 4.7,
                "Similarity": 0.624541163444519,
                "Skills": "Data Storytelling, Data Analysis, Business Intelligence, Data Visualization Software, Dashboard, Tableau Software, Interactive Data Visualization",
                "Subcategory": "Data Analysis",
                "Title": "Practice Exam for Tableau Certified Data Analyst",
                "Type": "Course"
            },
            {
                "Category": "Data Science",
                "Description": "Launch Your Career in Data Science. A ten-course introduction to data science, developed and taught by leading professors.",
                "Duration": "3 - 6 Months",
                "Enrolled": 501491,
                "Institution": "Johns Hopkins University",
                "Level": "Beginner",
                "Modules Description": [
                    "Set up R, R-Studio, Github and other useful tools\nUnderstand the data, problems, and tools that data analysts use\nExplain essential study design concepts\nCreate a Github repository",
                    "Understand critical programming language concepts\nConfigure statistical programming software\nMake use of R loop functions and debugging tools\nCollect detailed information using R profiler",
                    "Understand common data storage systems\nApply data cleaning basics to make data \"tidy\"\nUse R for text and date manipulation\nObtain usable data from the web, APIs, and databases",
                    "Understand analytic graphics and the base plotting system in R\nUse advanced graphing systems such as the Lattice system\nMake graphical displays of very high dimensional data\nApply cluster analysis techniques to locate patterns in data",
                    "Organize data analysis to help make it more reproducible\nWrite up a reproducible data analysis using knitr\nDetermine the reproducibility of analysis project\nPublish reproducible web documents using Markdown",
                    "Understand the process of drawing conclusions about populations or scientific truths from data\nDescribe variability, distributions, limits, and confidence intervals\nUse p-values, confidence intervals, and permutation tests\nMake informed data analysis decisions",
                    "Use regression analysis, least squares and inference\nUnderstand ANOVA and ANCOVA model cases\nInvestigate analysis of residuals and variability\nDescribe novel uses of regression models such as scatterplot smoothing",
                    "Use the basic components of building and applying prediction functions\nUnderstand concepts such as training and tests sets, overfitting, and error rates\nDescribe machine learning methods such as regression or classification trees\nExplain the complete process of building prediction functions",
                    "Develop basic applications and interactive graphics using GoogleVis\nUse Leaflet to create interactive annotated maps\nBuild an R Markdown presentation that includes a data visualization\nCreate a data product that tells a story to a mass audience",
                    "Create a useful data product for the public\nApply your exploratory data analysis skills\nBuild an efficient and accurate prediction model\nProduce a presentation deck to showcase your findings"
                ],
                "Modules Duration": [
                    "17 hours",
                    "57 hours",
                    "19 hours",
                    "55 hours",
                    "7 hours",
                    "55 hours",
                    "53 hours",
                    "8 hours",
                    "10 hours",
                    "5 hours"
                ],
                "Modules Name": [
                    "The Data Scientist's Toolbox",
                    "R Programming",
                    "Getting and Cleaning Data",
                    "Exploratory Data Analysis",
                    "Reproducible Research",
                    "Statistical Inference",
                    "Regression Models",
                    "Practical Machine Learning",
                    "Developing Data Products",
                    "Data Science Capstone"
                ],
                "Rating": 4.5,
                "Similarity": 0.606268048286438,
                "Skills": "Predictive Modeling, Machine Learning, Shiny (R Package), R Programming, Statistical Hypothesis Testing, Version Control, Data Visualization, Statistical Analysis, Data Wrangling, Exploratory Data Analysis, Leaflet (Software), Data Cleansing",
                "Subcategory": "Data Analysis",
                "Title": "Data Science",
                "Type": "Specialization"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of C Programming with Linux Specialization",
                "Duration": "1 - 3 Months",
                "Enrolled": 4935,
                "Institution": "Dartmouth College",
                "Level": "Beginner",
                "Modules Description": [
                    "Let's get coding!",
                    "By the end of Week 1, you will be able to describe the background, key dates, and important people of the creation of Linux projects, UNIX, and C. You will also be able to run commonly used pre-installed programs on Linux via the command line interface.",
                    "By the end of Week 2, You will be able to navigate through the Linux Filesystem with the command line interface. You will also be comfortable working with files and in directories using the following skills: creating, deleting, copying, renaming, and moving.",
                    "By the end of Week 3, you will be able to inspect the memory consumption of processes using the Linux common line interface (CLI), as well as build interactive programs for the CLI in the C programming language. You will also be able to evaluate the average CPU consumption, distinguish between compilation and interpretation of programs, and run/compile a program written in C on Linux.",
                    ""
                ],
                "Modules Duration": [
                    "1 hour",
                    "1 hour",
                    "2 hours",
                    "1 hour",
                    "21 minutes"
                ],
                "Modules Name": [
                    "Welcome",
                    "Week 1: History of Linux and the command line",
                    "Week 2: The Linux file system",
                    "Week 3: C program compilation with gcc",
                    "Concluding the course"
                ],
                "Rating": 4.6,
                "Similarity": 0.6050887703895569,
                "Skills": "Command-Line Interface, Linux, Computer Engineering, Linux Commands, Unix, Embedded Software, Computer Programming, C (Programming Language), Linux Servers, Operating Systems, Computer Programming Tools, Embedded Systems, Performance Tuning, Open Source Technology, File Systems, OS Process Management, File Management",
                "Subcategory": "Software Development",
                "Title": "Linux Basics: The Command Line Interface - 6",
                "Type": "Course"
            },
            {
                "Category": "Information Technology",
                "Description": "This course is part of Python for Cybersecurity Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 5556,
                "Institution": "Infosec",
                "Level": "Intermediate",
                "Modules Description": [
                    "Python and decoy development",
                    "Python has uses for defense and attack.",
                    "Explore the uses for python for monitoring."
                ],
                "Modules Duration": [
                    "1 hour",
                    "1 hour",
                    "1 hour"
                ],
                "Modules Name": [
                    "Python for active defense: Decoys",
                    "Python for active defense: Network",
                    "Python for active defense: Monitoring"
                ],
                "Rating": 4.5,
                "Similarity": 0.5946120023727417,
                "Skills": "Network Monitoring, Cyber Security Strategy, Cyber Operations, Cyber Threat Hunting, Network Security, Scripting, Scripting Languages, Threat Detection, Continuous Monitoring, Python Programming, Cybersecurity, System Monitoring",
                "Subcategory": "Security",
                "Title": "Python for Active Defense",
                "Type": "Course"
            },
            {
                "Category": "Information Technology",
                "Description": "This course is part of IBM z/OS Mainframe Practitioner Professional Certificate",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 10610,
                "Institution": "IBM",
                "Level": "Intermediate",
                "Modules Description": [
                    "",
                    "",
                    ""
                ],
                "Modules Duration": [
                    "8 hours",
                    "3 hours",
                    "6 hours"
                ],
                "Modules Name": [
                    "Introduction to JES and JCL",
                    "System Programming Components",
                    "z/OSMF and UNIX System Services"
                ],
                "Rating": 4.8,
                "Similarity": 0.5904772281646729,
                "Skills": "Data Management, System Programming, Transaction Processing, Mainframe Computing, File Systems, Job Control Language (JCL), System Configuration, Operating Systems, z/OS, Unix, IBM DB2",
                "Subcategory": "Support and Operations",
                "Title": "Basic System Programming on IBM Z",
                "Type": "Course"
            }
        ]
    },
    {
        "input": {
            "skill": [
                "Network Protocols",
                "Firewalls",
                "VPN",
                "Intrusion Detection Systems (IDS)",
                "Wireshark"
            ],
            "category": [
                "IT & Engineering"
            ],
            "top_n": 10
        },
        "recommendations": [
            {
                "Category": "Information Technology",
                "Description": "No Description",
                "Duration": "1 - 3 Months",
                "Enrolled": 4083,
                "Institution": "Infosec",
                "Level": "Beginner",
                "Modules Description": [
                    "Welcome to advanced Python for Cybersecurity. The Reconnaissance course demonstrates the use of Python to automate the process of performing reconnaissance on target environments. We will also demonstrate how Python can be used to automate a password guessing attach to gain initial access to a target environment.",
                    "This course demonstrates the use of Python to establish command-and-control channels between a target environment and the attackers infrastructure. This course also demonstrates the use of Python to collect information on a system, including both user credentials and other sensitive data.",
                    "This course demonstrates the use of Python for network analysis to detect and hijack suspicious connections."
                ],
                "Modules Duration": [
                    "3 hours",
                    "3 hours",
                    "2 hours"
                ],
                "Modules Name": [
                    "Advanced Python - Reconnaissance",
                    "Establishing Command-and-Control and Finding Credentials",
                    "Defensive Python"
                ],
                "Rating": 4.5,
                "Similarity": 0.7395131587982178,
                "Skills": "Network Monitoring, Threat Detection, Network Security, Automation, Cybersecurity, Scripting, System Programming, Penetration Testing, Network Analysis, TCP/IP, Authentications, User Accounts",
                "Subcategory": "Security",
                "Title": "Advanced Python Scripting for Cybersecurity",
                "Type": "Specialization"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of Developing Industrial Internet of Things Specialization",
                "Duration": "1 - 3 Months",
                "Enrolled": 35661,
                "Institution": "University of Colorado Boulder",
                "Level": "Intermediate",
                "Modules Description": [
                    "In this module, you will see a specialization overview of all 3 courses, an overview of this course, and a lesson on writing resumes and interviewing for a job.",
                    "In this module, you will see an overview of the 5 Industrial IoT (IIoT) Markets covered in this course, and learn the key skills necessary to work in the IIoT space. Additionally, you will learn about the enabling factors that made it possible for the IIoT to come into existence, what a platform is, and the leading suppliers of platforms. I'll give you a quick look at an example building automation deployment and how a platform creates the \"glue\" that ties the entire system together. We will also take a look at the software and services markets.",
                    "In this module, you will learn about the top 5 IIoT market application areas. Additionally, we will look at the considerations involved in selecting a real-time operating system (RTOS) for an IIoT end node (Think: A single board computer with sensors and actuators, controlling a manufacturing machine like a lathe or a drill).",
                    "In this module, we look at networking concepts and two important technologies: Network Functions Virtualization (NFV) and Software Defined Networks (SDN). We then move on to a survey of long-range and short-range wireless protocols used in IIoT deployments.",
                    "This is the most important module in the entire specialization and this course. With billions of devices connected to the internet, security is of paramount importance. I will share with you the bulk of my experience in developing security solutions for end-node type devices. In my career, the products I worked on were satellite TV decoder chips, hard drives and solid state drives (storage devices). The security principles that work for these chips and storage devices apply equally well to IIoT devices."
                ],
                "Modules Duration": [
                    "1 hour",
                    "2 hours",
                    "1 hour",
                    "2 hours",
                    "5 hours"
                ],
                "Modules Name": [
                    "Specialization Overview, Writing Resumes",
                    "Market Overview, Platforms, Software and Services",
                    "Top 5 IIoT Markets, Realtime Operating Systems",
                    "Networking and Wireless Communication Protocols",
                    "Security"
                ],
                "Rating": 4.7,
                "Similarity": 0.6999555826187134,
                "Skills": "Emerging Technologies, Network Protocols, Wireless Networks, Cryptography, Real-Time Operating Systems, Infrastructure Security, Software-Defined Networking, Market Analysis, Market Intelligence, Cybersecurity, Internet Of Things, Cloud Platforms, Embedded Systems, General Networking",
                "Subcategory": "Design and Product",
                "Title": "Industrial IoT Markets and Security",
                "Type": "Course"
            },
            {
                "Category": "Information Technology",
                "Description": "This course is part of Cybersecurity Risk Management Framework Specialization",
                "Duration": "1 - 3 Months",
                "Enrolled": 8681,
                "Institution": "Infosec",
                "Level": "Mixed",
                "Modules Description": [
                    "This video introduces the National Institute of Standards and Technology Cybersecurity Framework (NIST CSF) 2.0 for improving critical infrastructure cybersecurity.",
                    "The NIST CSF contains terminology and concepts that may be expressed in specific ways to include perspectives and usages that may be unique to the framework implementation and different from what you are used to dealing with in your normal operations.  You must have a basic understanding of security fundamentals used throughout the industry. For instance, the familiar CIA triad will be mentioned extensively throughout our courses.  Additionally, there are some aspects of the framework that are contained throughout all discussion of the topics in this course. We're introducing them here, they include: Cybersecurity & Information Security, Drivers of Business & Environments, and Cybersecurity Fundamentals. These concepts will be included in various discussions throughout all modules of this course, and you should become familiar with them.",
                    "The NIST CSF, because it is a risk-based approach for managing cybersecurity risk, is composed of three parts: the Framework Core with its four areas and five processes, the four Framework Implementation Tiers and its programs and processes, and the Framework Profiles, goals, types and levels.  Each Framework component reinforces the connection between business and mission drivers and cybersecurity activities.",
                    "The NIST CSF provides a common language to communicate requirements among interdependent stakeholders responsible for the delivery of essential critical infrastructure products and services.  For example, an organization may use a target profile to express cybersecurity risk management requirements to an external service provider (e.g., a cloud provider to which it is exporting data). In addition, an organization may express its cybersecurity state through a current profile to report results or to compare with acquisition requirements, we will cover more examples in the course.",
                    "Risk management is the ongoing process of identifying, assessing, and responding to risk. To manage risk, organizations should understand the likelihood that an event will occur and the potential resulting impacts. With this information, organizations can determine the acceptable level of risk for achieving their organizational objectives and can express this as their risk tolerance.  Risks affecting organizations can have consequences from economic performance impacts to professional reputation. In this course we discuss the RMF process which provides a disciplined, structured, and flexible process for managing security and privacy risk which includes information security categorization; control selection, implementation, and assessment; system and common control authorizations; and continuous monitoring. We also discuss how managing risk by identifying, assessing, and responding to risk helps organizations perform better in an environment full of uncertainty.",
                    "Cyber SCRM is the set of activities necessary to manage cybersecurity risk associated with external parties. More specifically, cyber SCRM addresses both the cybersecurity effect an organization has on external parties and the cybersecurity effect external parties have on an organization.",
                    "The core functions are a listing of categories, subcategories and informative references that describe specific cybersecurity activities common across all critical infrastructure sectors. They are not intended to form a serial path or lead to a static desired end state. Rather, the functions should be performed concurrently and continuously to form an operational culture that addresses the dynamic cybersecurity risk. This course describes the six framework core functions (Govern, Identify, Protect, Detect, Respond and Recover) and includes descriptions of categories, subcategories and informative references.",
                    "The CSF is designed to complement existing business and cybersecurity operations. It can serve as the foundation for a new cybersecurity program or a mechanism for improving an existing program. It provides a means of expressing cybersecurity requirements to business partners and customers. Additionally, it can help identify gaps in an organization's cybersecurity practices. The course outlines the steps an organization can use to compare their current cybersecurity activities with those outlined in the CSF core through the creation of profiles to determine if it has opportunities to or needs to improve.",
                    "The CSF is designed to reduce risk by improving the management of cybersecurity risk to organizational objectives. Ideally, organizations using the Framework will be able to measure and assign values to their risk along with the cost and benefits of steps taken to reduce risk to acceptable levels. This course describes the importance of having a clear understanding of the organizational objectives, the relationship between those objectives and supportive cybersecurity outcomes, and how those discrete cybersecurity outcomes are implemented and managed to assist the organization in predicting whether a cybersecurity risk may occur, and the impact it might have.",
                    ""
                ],
                "Modules Duration": [
                    "6 minutes",
                    "42 minutes",
                    "25 minutes",
                    "6 minutes",
                    "22 minutes",
                    "7 minutes",
                    "14 minutes",
                    "9 minutes",
                    "12 minutes",
                    "41 minutes"
                ],
                "Modules Name": [
                    "NIST CSF instructor and path introduction",
                    "NIST cybersecurity basics",
                    "Cybersecurity framework components",
                    "Communicating cybersecurity requirements",
                    "Risk management",
                    "Cyber supply chain risk management (SCRM)",
                    "Cybersecurity framework core functions",
                    "7-step cybersecurity framework process",
                    "Cybersecurity framework self assessment process",
                    "Cybersecurity Framework Summary and Tips"
                ],
                "Rating": 4.3,
                "Similarity": 0.6928163170814514,
                "Skills": "Risk Management, Asset Management, Infrastructure Security, Security Controls, Stakeholder Communications, Risk Management Framework, Vulnerability Assessments, Continuous Improvement Process, Cyber Security Assessment, Cyber Governance, Cybersecurity, Cyber Risk, Cyber Security Strategy",
                "Subcategory": "Security",
                "Title": "NIST CSF",
                "Type": "Course"
            },
            {
                "Category": "Information Technology",
                "Description": "No Description",
                "Duration": "1 - 3 Months",
                "Enrolled": 3755,
                "Institution": "Google - Spectrum Sharing",
                "Level": "Mixed",
                "Modules Description": [
                    "A quick overview of shared spectrum and terminology",
                    "What are CPIs and why are they needed?",
                    "Terminology and concepts",
                    "Detailed information on how to fulfill your responsibilities",
                    "The path to become CPI certified",
                    "Continuing responsibilities for the CPI and TPA",
                    ""
                ],
                "Modules Duration": [
                    "30 minutes",
                    "11 minutes",
                    "9 minutes",
                    "1 hour",
                    "6 minutes",
                    "6 minutes",
                    "1 hour"
                ],
                "Modules Name": [
                    "What is CBRS?",
                    "The role of CPIs  in CBRS",
                    "More background  on CBRS",
                    "How to do the CPI job",
                    "Steps to certification",
                    "The future",
                    "CPI Exam"
                ],
                "Rating": 4.5,
                "Similarity": 0.6787122488021851,
                "Skills": "Telecommunications, Key Management, Record Keeping, Network Infrastructure, Data Entry, Technical Communication, Software Installation, System Configuration, System Implementation, Wireless Networks",
                "Subcategory": "Networking",
                "Title": "Become a CBRS Certified Professional Installer by Google",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of Network Systems: Principles in Practice Specialization",
                "Duration": "1 - 3 Months",
                "Enrolled": 5696,
                "Institution": "University of Colorado Boulder",
                "Level": "Intermediate",
                "Modules Description": [
                    "Welcome to Network Systems Foundations, over the next five weeks you'll explore topics related to network systems. This will center on the layered design of networks, and cover the link layer (Ethernet), network layer (IP), transport layer (TCP, UDP), and application layer (HTTP, gRPC).  With those as a foundation, you will learn about network security problems and how current solutions work at different layers. \n\nWe'll start the course  by understanding the Link Layer, comprehending its critical role, and exploring why it's vital in the realm of network communication. You'll explore the intriguing behavior of network switches, investigating how they react when receiving frames with various destination MAC addresses. You'll learn to distinguish between the characteristics of different channel partitioning methods, offering valuable insights into network efficiency. You'll explore the Ethernet Frame Check Sequence (FCS) field, uncovering its role and significance in data integrity. Finally, you'll have the opportunity to put your knowledge to the test by designing and developing Python code that can skillfully manage route announcements and withdrawals, ensuring the efficient maintenance of a routing table.",
                    "This week, you will explore the network layer, which is responsible for routing packets between different networks and deals with logical addressing, routing, and forwarding. Throughout the week, you'll learn about the intricacies of the Internet Protocol (IP) and its pivotal role in orchestrating the efficient routing of data. Then, you will explore the intricate operations of router data planes and the concept of routing, focusing on the distinctions between Routing Link State Protocol and Routing Path Vector Protocol. You will then turn your attention to troubleshooting techniques for resolving network layer issues. At the end of the week, you will be tasked with the development of a Python program that simulates the functionalities of a simplified router akin to those employed in the Border Gateway Protocol (BGP).",
                    "This week, you will explore the transport layer, which ensures end-to-end communication, error detection, and data flow control, and protocols like TCP (Transmission Control Protocol) and UDP (User Datagram Protocol) work at this layer. You'll begin the week with an overview of the transport layer and its relationship with the other layers. Then, you learn about multiplexing and how to efficiently combine multiple data streams into a single channel. Then the TCP protocol will be explored, beginning with the establishment of connections and extending to the nuances of congestion control. The concludes with a programming assignment in Python, where you will analyze a pcap file containing a single TCP flow to determine the maximum bytes in flight—a hands-on exploration of the week's concepts.",
                    "This week, you will explore the application layer, where application-specific protocols and services reside. It includes protocols for services like email (e.g., SMTP), web browsing (e.g., HTTP), and file transfer (e.g., FTP). You'll begin the week with an overview of the application layer and its relationship with the other layers. Then, you'll explore the Domain Name System (DNS), unraveling its role in translating domain names to IP addresses. A vital aspect of network application development, socket programming, will be discussed, equipping you with the knowledge to facilitate network communication. The week further delves into application protocols, specifically HTTP and gRPC, detailing their structures and functions. This week, you'll have two programming assignments: one to explore gRPC, and the other, a graded assignment, to create a client-server using socket programming for RPC functionality.",
                    "In this final week, you will delve into network security. The week begins with the basics of network security, then focuses on the intricacies of IPsec, securing the network data plane, and the role of RPKI in fortifying the network control plane. You will examine the bedrock of secure communication—TLS/HTTPS, which extends its protective embrace to the transport and application layers. The week will end with a programming assignment where you will create a digital certificate for a web server."
                ],
                "Modules Duration": [
                    "3 hours",
                    "5 hours",
                    "3 hours",
                    "4 hours",
                    "2 hours"
                ],
                "Modules Name": [
                    "Link Layer",
                    "Network Layer",
                    "Transport Layer",
                    "Application Layer",
                    "Network Security"
                ],
                "Rating": 4.5,
                "Similarity": 0.6671031713485718,
                "Skills": "Public Key Infrastructure, Network Routers, TCP/IP, Web Applications, Network Protocols, Routing Protocols, System Programming, OSI Models, Computer Networking, Cryptography, Network Infrastructure, Network Architecture, Network Security, Network Model",
                "Subcategory": "Computer Security and Networks",
                "Title": "Network Systems Foundations",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "Learn advanced network security techniques. Gain an understanding of advanced security tools and systems to design secure networks",
                "Duration": "1 - 3 Months",
                "Enrolled": 2523,
                "Institution": "LearnQuest",
                "Level": "Advanced",
                "Modules Description": [
                    "The dynamic landscape of network security, the mastery of advanced tools is imperative. This course is crafted to equip participants with an in-depth understanding of next-generation firewalls and intrusion prevention systems (IPS), pivotal components in contemporary network security.\nCourse Highlights:\n\nReal-world Use Cases: Analyze real-world use cases of next-generation firewalls, emphasizing practical applications in diverse scenarios. Understand how these systems perform in response to actual security challenges.\n\nIntrusion Prevention System Implementation: Implement intrusion prevention systems within a network environment. Learn to maintain and update IPS rules and signatures for proactive threat prevention.\n\nEffectiveness Evaluation: Acquire skills to evaluate the effectiveness of intrusion prevention systems. Understand the importance of regular assessments to adapt and enhance security measures.\n\nOutput Interpretation: Develop proficiency in interpreting output from both next-generation firewalls and intrusion prevention systems. Learn to extract actionable insights to identify and respond to potential threats.\n\nThreat Response: Respond effectively to identified threats by applying strategic and timely measures. Understand the escalation process based on the severity of security incidents.\n\nOngoing Network Monitoring Strategy: Design a comprehensive strategy for ongoing network monitoring. Explore best practices for continuous threat response, ensuring the adaptability of security measures in the face of evolving threats.\n\nWho Should Attend:\nThis course is tailored for network security professionals, cybersecurity analysts, and IT professionals seeking to deepen their expertise in next-generation firewalls and intrusion prevention systems. Participants should have a foundational understanding of network security concepts.\n\nElevate your network security prowess with the \"Next-Gen Firewalls and Intrusion Prevention\" course. By mastering advanced security infrastructure, participants will be well-prepared to navigate the complexities of modern cybersecurity challenges.",
                    "In the dynamic landscape of modern IT, organizations are increasingly adopting cloud and hybrid environments, transforming the way networks operate. This advanced network security course is designed to equip participants with specialized knowledge and hands-on experience in securing cloud and hybrid networks. As these environments present unique challenges, understanding effective strategies and best practices is crucial for maintaining a robust security posture.\nCourse Highlights:\n\nComprehensive Coverage: Delve into the intricacies of cloud and hybrid network security, covering fundamental principles, emerging threats, and advanced defense mechanisms.\n\nPractical Experience: Gain hands-on experience with cutting-edge tools and techniques used in securing cloud and hybrid environments. \n\nBest Practices: Explore industry best practices endorsed by experts in the field. Understand how to implement these strategies to fortify network security and mitigate potential risks.\n\nChallenges and Solutions: Navigate through the specific challenges posed by cloud and hybrid networks. Develop a nuanced understanding of the solutions and countermeasures essential for safeguarding against evolving threats.\n\nPrerequisites:\nParticipants should have a foundational understanding of network security concepts and experience with basic network administration. Familiarity with cloud computing principles and hybrid network architectures is beneficial but not mandatory. The course is designed for security professionals, network administrators, and IT professionals seeking to enhance their expertise in the context of cloud and hybrid environments.\n\nWhether you're looking to advance your career, stay ahead of industry trends, or deepen your knowledge in network security, this course provides a structured and comprehensive approach. By the end of the program, participants will be well-equipped to address the complexities of securing cloud and hybrid networks in today's technology landscape.",
                    "In the ever-evolving landscape of cybersecurity, organizations face escalating threats that demand advanced skills in threat hunting and incident response. This comprehensive course is designed to empower participants with advanced techniques to not only detect but effectively respond to cybersecurity incidents.\nCourse Highlights:\n\nProactive Threat Hunting: Explore advanced techniques for proactively seeking out and identifying potential threats within a network. Understand how to leverage threat intelligence and advanced tools to enhance threat hunting capabilities.\n\nReal-world Scenarios: Gain hands-on experience by navigating through real-world cybersecurity scenarios. Simulations and practical exercises ensure participants are well-prepared to face the challenges of threat hunting and incident response.\n\nCrisis Management: Learn effective incident response strategies to navigate through cybersecurity crises. Understand the importance of swift and decisive actions to minimize damage and facilitate recovery.\n\nWho Should Attend:\nThis course is tailored for cybersecurity professionals, incident responders, network security analysts, and IT professionals seeking to advance their skills in threat hunting and incident response. Participants should have a foundational understanding of cybersecurity principles.\n\nPrepare yourself for the high-stakes world of cybersecurity with the Advanced Threat Hunting and Incident Response course. By the end of the program, participants will possess the knowledge and skills necessary to navigate and effectively respond to cybersecurity crises in today's complex threat landscape."
                ],
                "Modules Duration": [
                    "8 hours",
                    "8 hours",
                    "9 hours"
                ],
                "Modules Name": [
                    "Next-Generation Firewalls and Intrusion Prevention",
                    "Securing Cloud and Hybrid Networks",
                    "Advanced Threat Hunting and Incident Response"
                ],
                "Rating": 4.3,
                "Similarity": 0.6639442443847656,
                "Skills": "Network Monitoring, Intrusion Detection and Prevention, Threat Detection, Network Security, Computer Security Incident Management, Cybersecurity, Disaster Recovery, Security Management, Cyber Threat Hunting, Security Strategy, Threat Management, Security Controls",
                "Subcategory": "Computer Security and Networks",
                "Title": "Advanced Network Security",
                "Type": "Specialization"
            },
            {
                "Category": "Information Technology",
                "Description": "Master Modern Networking. Gain Hands-On Experience in Linux and Cloud Networking",
                "Duration": "3 - 6 Months",
                "Enrolled": 2762,
                "Institution": "University of Colorado Boulder",
                "Level": "Intermediate",
                "Modules Description": [
                    "Describe networking layers in depth and how they relate to one another.\nAnalyze traffic through python programming.\nDesign a simplified routing protocol that has similar features as to what powers the Internet.\nDevelop a client and server with socket programming.",
                    "Describe Linux networking in depth, including how the kernel processes traffic and how Linux utilities are used\nCreate network appliances (switch, router, gateway) with Linux\nDescribe how Linux's network namespaces work\nDesign and build networking support for containerized applications, including a network plugin for Kubernetes",
                    "Create and secure simple cloud applications\nDesign and deploy complex applications that are segmented and/or geographically distributed\nAnalyze tradeoffs between different cloud networking services in architecting a distributed infrastructure\nDescribe how various cloud abstractions are (or might have been) architected"
                ],
                "Modules Duration": [
                    "19 hours",
                    "17 hours",
                    "20 hours"
                ],
                "Modules Name": [
                    "Network Systems Foundations",
                    "Network Principles in Practice: Linux Networking",
                    "Network Principles in Practice: Cloud Networking"
                ],
                "Rating": 4.5,
                "Similarity": 0.6631847620010376,
                "Skills": "Kubernetes, Network Security, Terraform, Cloud Computing, Virtualization, Network Architecture, Cloud Infrastructure, TCP/IP, Network Routers, Software-Defined Networking, Computer Networking, Linux",
                "Subcategory": "Networking",
                "Title": "Network Systems: Principles in Practice",
                "Type": "Specialization"
            },
            {
                "Category": "Information Technology",
                "Description": "No Description",
                "Duration": "1 - 3 Months",
                "Enrolled": 9097,
                "Institution": "Infosec",
                "Level": "Intermediate",
                "Modules Description": [
                    "In this introductory module with Keatron Evans, you'll explore cyber threat hunting: defining it, skills required, hunt modeling with hypotheses, implementation benefits and more.",
                    "In this module, you'll explore what's needed for a really effective threat-hunting program. You'll also learn about artifacts, indicators of compromise, tactics, techniques and procedures, the Pyramid of Pain and many more insights from Keatron.",
                    "Explore the concepts of anomalous activity and investigation. The purpose of this module is to help the threat hunter identify whether an anomalous activity is a threat. Explore how to investigate, walking through the information and identifying any issues right away. In this course, Keatron uses generative AI to quickly find malicious activity.",
                    "In this module, you'll explore the differences between structured and unstructured hunts with Keatron. You will also get into entity-driven hunting.",
                    "In this course, Keatron will take you through different data sources that you may hunt through. These include SIEMs, EDR and XDR logs, threat intelligence platforms and several other data sources.",
                    "In this course, you will learn how to build a hunt. Keatron gets into the details of all the things the learner must consider when building out a hunt and scoping. We also discuss lessons learned and proper execution.",
                    "In this course, you'll see how different threat hunting scenarios play out. We will use real-world examples to illustrate how we form a hypothesis all the way through lessons learned.",
                    "In this course, we will go on a deep dive with Keatron concerning network-based threats, including DNS, DDoS and irregular traffic, plus more. This course will include some labs and demonstrations. Locate even the hardest-to-find malware with these techniques.",
                    "In this course, Keatron will walk through various host-based threats and indicators. There will be labs and demonstrations that include memory forensics, PowerShell and Windows event log parsing."
                ],
                "Modules Duration": [
                    "31 minutes",
                    "39 minutes",
                    "41 minutes",
                    "27 minutes",
                    "36 minutes",
                    "24 minutes",
                    "32 minutes",
                    "34 minutes",
                    "4 hours"
                ],
                "Modules Name": [
                    "Cyber threat hunting introduction",
                    "Threat hunting artifacts and types",
                    "Threat hunting techniques and generative AI",
                    "Threat hunting methodologies",
                    "Threat hunting data and technologies",
                    "Cyber threat hunting process",
                    "Cyber threat hunting scenarios",
                    "Hunting for network-based threats",
                    "Hunting for host-based threats"
                ],
                "Rating": 4.5,
                "Similarity": 0.6615679860115051,
                "Skills": "Cyber Threat Intelligence, Threat Modeling, Threat Detection, Anomaly Detection, Generative AI, Event Monitoring, MITRE ATT&CK Framework, Intrusion Detection and Prevention, Endpoint Detection and Response, Network Analysis, System Monitoring, Cyber Threat Hunting, Security Information and Event Management (SIEM), Linux, Malware Protection",
                "Subcategory": "Security",
                "Title": "Cyber Threat Hunting",
                "Type": "Course"
            },
            {
                "Category": "Information Technology",
                "Description": "This course is part of Information Assurance Analysis Specialization",
                "Duration": "1 - 3 Months",
                "Enrolled": 0,
                "Institution": "Johns Hopkins University",
                "Level": "Intermediate",
                "Modules Description": [
                    "Throughout this course, we will explore key anonymization techniques and the associated challenges, including legal implications. You'll learn about various mechanisms for user anonymity, such as onion routing and DHTs, and uncover methods of deanonymization. We'll also dive into cybersecurity threats, including ransomware and Bluetooth vulnerabilities, while discussing mobile application security in the context of BYOD policies. Finally, we'll cover DNS fundamentals, TCP/IP protocols, and hands-on analysis with tools like Wireshark.",
                    "In this module, we discuss techniques for anonymizing and deanonymizing network traffic data. Anonymization is the process of removing information that can be used to identify a user and may be done as a post-processing effort, or by using systems that hide the user's identity during normal operations. Anonymity has been a major concern in network security for the past thirty years, with an especially active interest in the last decade with the rise and fall of Napster and other peer-to-peer applications.",
                    "In this module, we will discuss and be introduced to various risks, threats, and attack vectors/surfaces for mobile platforms and devices. We will learn how DoS attacks on IEEE 802.11 protocols occur, gain a better understanding of WEP, WPA, and WPA2, and learn about the overall security issues surrounding mobile platforms. Students will discuss different pieces of legislation being considered to protect mobile application users & personal data privacy laws. Mobile application & cloud-based scanning tools, as well as OWASP mobile and application program interface vulnerabilities will be studied.",
                    "In this module, we will discuss the use of DNS, one of the Internet's most important protocols.  DNS is the protocol that translates domain names into IP addresses, but more importantly in the modern internet, it is used to hide the multiplexing and geolocation mechanisms that are used to enhance internet performance.  Due to its centrality to network traffic, DNS is one of the most hacked and modified protocols in active use, and the way that it is used both by legitimate and illegitimate uses is critical for understanding modern Internet security.",
                    "This module covers the evolution of the HTTP protocol and clarifies the distinctions between HTTP, HTML, and the web. It includes an overview of common log formats such as CLF and ELF, and practical configuration of Apache and IIS for log file generation. Students will delve into log collection and analysis tools, particularly Splunk, and learn about iframe exploitation, sandbox countermeasures against clickjacking, and frame-busting techniques along with HTTP headers rulesets.",
                    "This module explores the journey of digital messages from origin to destination, highlighting the functions of DNS, SMTP, and POP/IMAP. It covers the role of priority in DNS MX records, how spammers exploit SMTP, and the use of Network Time Protocol (NTP). Students will also delve into various filtering techniques and data analysis tools.",
                    "This module covers the fundamentals of TCP state transitions, including predicting state changes based on incoming packets. Students will explore the TCP sequence numbering mechanism, the role of MTU, Ethernet, and lower-level protocols, and understand TCP addressing and session concepts. The course includes practical experience capturing sessions with TCPDump, distinguishing between promiscuous and normal modes, and analyzing traffic using TCPDump or Wireshark. Additionally, students will study common TCP attacks such as sequence number spoofing, Christmas tree packets, and TCP scanning."
                ],
                "Modules Duration": [
                    "16 minutes",
                    "7 hours",
                    "10 hours",
                    "11 hours",
                    "9 hours",
                    "5 hours",
                    "9 hours"
                ],
                "Modules Name": [
                    "Course Introduction",
                    "Anonymization",
                    "Mobile Application Security",
                    "DNS Analysis",
                    "HTTP Analysis",
                    "SMTP Analysis",
                    "TCP Analysis"
                ],
                "Rating": "No rating",
                "Similarity": 0.6605625748634338,
                "Skills": "Information Privacy, Open Web Application Security Project (OWASP), Network Analysis, Splunk, Network Security, Network Protocols, Wireless Networks, Threat Detection, Cybersecurity, Application Security, Email Security, Intrusion Detection and Prevention, Mobile Security, TCP/IP",
                "Subcategory": "Security",
                "Title": "Advanced Network Security and Analysis",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of Mastering Recommendation Systems with Python Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "EDUCBA",
                "Level": "Intermediate",
                "Modules Description": [
                    "This module introduces learners to the core concepts and implementation of a movie recommendation engine using Python. It begins by contextualizing the significance of recommender systems in modern digital platforms and then guides learners through setting up their development environment, importing essential libraries, and exploring fundamental recommendation techniques. Through a blend of conceptual overview and hands-on coding, learners will develop both a simple popularity-based recommender and a more advanced content-based filtering system using movie metadata."
                ],
                "Modules Duration": [
                    "1 hour"
                ],
                "Modules Name": [
                    "Building Foundations of a Movie Recommender System"
                ],
                "Rating": "No rating",
                "Similarity": 0.6595561504364014,
                "Skills": "Feature Engineering, Data Processing, Pandas (Python Package), Python Programming, Applied Machine Learning, Data Science, Machine Learning, Data Manipulation, NumPy, Predictive Modeling",
                "Subcategory": "Algorithms",
                "Title": "Develop a Movie Recommendation Engine",
                "Type": "Course"
            }
        ]
    },
    {
        "input": {
            "skill": [
                "Unity",
                "C#",
                "Unreal Engine",
                "Blueprints",
                "Frame Rate"
            ],
            "category": [
                "IT & Engineering",
                "Design & Creative"
            ],
            "top_n": 10
        },
        "recommendations": [
            {
                "Category": "Computer Science",
                "Description": "This course is part of Epic Games Game Design Professional Certificate",
                "Duration": "1 - 3 Months",
                "Enrolled": 9276,
                "Institution": "Epic Games",
                "Level": "Beginner",
                "Modules Description": [
                    "In this introductory module, we lay the groundwork for your Unreal Engine 5 journey by guiding you through the essential setup and familiarizing you with the core interfaces and workflow. You'll learn how to install UE5, navigate the editor's UI, manage assets and content, integrate with Quixel Bridge for high-quality scans, and dive into creating basic materials. By the end, you'll have a strong foundation in UE5's fundamentals, preparing you for more advanced topics.",
                    "This module covers the fundamentals of world building in Unreal Engine 5, including terrain sculpting, landscape material creation, foliage placement, water system tools, and asset management techniques. Gain practical skills in creating immersive environments, from sculpting landmasses to procedurally populating scenes with foliage, blending materials, and placing meshes effectively.",
                    "This module equips you with fundamental skills in lighting and audio for Unreal Engine 5 projects. Explore various lighting techniques, from basic light setup to next-gen technology systems like Lumen, ensuring visually stunning environments. Additionally, the module covers essential audio features, including audio asset management, sound design, and tools for creating immersive soundscapes.",
                    "This module covers the essentials of collaboration and sharing in Unreal Engine 5, with a focus on version control using Perforce's Helix system and techniques for efficient asset management across projects. Gain practical skills in setting up version control, managing file revisions, and resolving conflicts.  Learn how to streamlining workflows through asset migration and share your project with simple packaging.",
                    "In this final project, you will apply everything you've learned in the course to create a compelling and immersive 3D environment in Unreal Engine 5, referred to as your \"Unreal Paradise.\" This task will involve landscape creation, asset integration, lighting, and audio implementation to bring your scene to life. The use of source control is highly encouraged but is optional and will not be used as a marking or grading criteria for successful completion of this final project."
                ],
                "Modules Duration": [
                    "7 hours",
                    "5 hours",
                    "2 hours",
                    "2 hours",
                    "3 hours"
                ],
                "Modules Name": [
                    "Introduction to Unreal Engine",
                    "Introduction to world building",
                    "Introduction to lighting and sound",
                    "Introduction to collaboration and sharing",
                    "Unreal Engine fundamentals: Final project"
                ],
                "Rating": 4.7,
                "Similarity": 0.7023875713348389,
                "Skills": "Software Installation, Game Design, Virtual Environment, Version Control, 3D Modeling, Video Game Development, Augmented and Virtual Reality (AR/VR), Multimedia, Computer Graphics, Unreal Engine, Animation and Game Design",
                "Subcategory": "Design and Product",
                "Title": "Unreal Engine Fundamentals",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of iOS Development for Creative Entrepreneurs Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 10064,
                "Institution": "University of California, Irvine",
                "Level": "Mixed",
                "Modules Description": [
                    "In this week we are going to do a deep dive on the sensors in the iOS platform.  Sensors are one of the aspects of smartphones that make them a unique platform and form a bridge between the digital and physical world.  We will look at different ways of bridging that divide with location sensors (and street address look-ups via reverse geocoding), geofencing and motion sensors. This will give you the skills to write code that makes your apps aware of the world around them and possibly even react to a user's physical movement.",
                    "Working with light levels from the physical world is tough on iOS, but this week we will show you a way to access the ambient light around the device by leveraging the screen brightness. Then we will flip the paradigm. Instead of trying to sense the physical world, we will act in the physical world by playing sounds. We will introduce two methods of playing sounds in apps (not the only ways by any means).",
                    "This week we give you the foundation for making games with SpriteKit. How do you build a game?  How do you load assets into your game?  How do you make them move and respond?  We will start with the \"Hello, World\" of games, \"Pong\".  That will give a quick intro into how games work. Then we will return to each of the steps that we leveraged in making Pong and go into more depth explaining what we did along the way.  In the in depth tutorial we will keep a running example of a game of \"Breakout\" tracking along with our progress.  The focus of this style of game is on leveraging the physics engine, and detecting and responding to collisions in 2 dimensions.  We will show the student how to place sprites, react to multi-touch interaction, detect and respond to contact events.",
                    "In this final week we will explore the different actions that can be initiated by your Sprites to create dynamic games.  By leveraging the SKAction class, complicated multi-step animations, sounds and effects can be chained together without the app developer having to micro-manage their unfolding.  We will also introduce particle systems as they are a fun and efficient way to simulate effects like smoke, fire and magic. Lastly, we will show you how to interact with Game Center so that you can add social action to your games. That includes leaderboards and achievements that are visible to the user's social network and add a fun element of competition to any game."
                ],
                "Modules Duration": [
                    "5 hours",
                    "2 hours",
                    "5 hours",
                    "3 hours"
                ],
                "Modules Name": [
                    "Location, Locomotion and Motion",
                    "Lights and Sounds",
                    "Touch, Collision, Reaction",
                    "Where the Action Is"
                ],
                "Rating": 4.5,
                "Similarity": 0.6524430513381958,
                "Skills": "Human Computer Interaction, Interaction Design, Game Design, Mobile Development, Video Game Development, User Interface (UI), Swift Programming, Geographic Information Systems, Augmented Reality, Animation and Game Design, Apple iOS, iOS Development, Global Positioning Systems",
                "Subcategory": "Software Development",
                "Title": "Games, Sensors and Media",
                "Type": "Course"
            },
            {
                "Category": "Information Technology",
                "Description": "No Description",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Google Cloud",
                "Level": "Beginner",
                "Modules Description": [
                    "This module explores the burgeoning field of Generative AI and its profound implications for today's business landscape.",
                    "This module focuses on the practical application of Generative AI in talent development. You will learn how to use AI to assess team skills, identify role-specific gaps, analyze those gaps, and recommend targeted training programs.",
                    "This module summarizes the key concepts and practical applications covered in this course.",
                    "Student FAQ"
                ],
                "Modules Duration": [
                    "3 minutes",
                    "1 hour",
                    "1 minute",
                    "10 minutes"
                ],
                "Modules Name": [
                    "Revolutionize Your Approach to Team Training",
                    "Assess Your Team's Learning Needs",
                    "Course Summary",
                    "Course Resources"
                ],
                "Rating": "No rating",
                "Similarity": 0.6437814235687256,
                "Skills": "Gap Analysis, Generative AI Agents, Business Solutions, Talent Management, Innovation, Team Performance Management, People Development, Decision Support Systems, Team Management, Training Programs, Performance Analysis, Needs Assessment",
                "Subcategory": "Cloud Computing",
                "Title": "Unleash Team Potential: Assess Learning Needs Using GenAI",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "No Description",
                "Duration": "1 - 3 Months",
                "Enrolled": 0,
                "Institution": "Packt",
                "Level": "Beginner",
                "Modules Description": [
                    "In this module, we will introduce the foundational concepts and setup required to begin your journey with Unreal Engine. You'll start by understanding what makes Unreal Engine unique, followed by step-by-step guidance on installation and project creation. We will also explore Levels and Actors, essential components of any game, giving you the basic knowledge needed for more advanced modules.",
                    "In this module, we will dive deep into the Unreal Engine Level Editor, the hub for creating and managing game environments. You'll learn how to navigate and customize the interface, use various editing modes, and master the Viewport for efficient scene creation. Additionally, we'll cover content management through the Content Browser and how to organize your Level's components using the Outliner, ensuring a streamlined workflow as you build your game world.",
                    "In this module, we will explore the diverse types of Actors in Unreal Engine, essential building blocks for any game or simulation. You'll begin by learning about static meshes, brushes, and materials, crucial for constructing your environment. We'll delve into lighting techniques and atmospheric effects to elevate the visual quality of your game. Additionally, you'll understand the use of volumes and player start points, ensuring your Level is both functional and immersive. Finally, hands-on tutorials will guide you through creating a sky, designing a playing area, and building inner structures to solidify your knowledge.",
                    "In this module, we will delve into Unreal Engine's powerful Blueprint system, a visual scripting tool that allows you to create complex game logic without writing code. You'll begin by exploring the fundamental components of Blueprints, including variables, functions, and flow control nodes. We will then cover how to access and manipulate Actors within your Level using Blueprints. Through hands-on tutorials, you'll gain practical experience by creating interactive elements such as an elevator platform, enemy behaviors, and a rotating door, equipping you with the skills to bring your game ideas to life.",
                    "In this module, we will explore how players interact with the game world through Unreal Engine's Player and Input systems. You'll start by learning about Game Modes, which define the rules of gameplay, and then delve into the intricacies of Pawns and Characters, including their movement and physics properties. We will cover how Controllers manage player and AI inputs, and how to enhance these inputs with advanced settings like triggers and modifiers. Through practical application, you'll build a playable character, equipping you with the skills to bring player interactions to life in your game.",
                    "In this module, we will delve into the essential aspects of collision in Unreal Engine, focusing on how objects in your game world interact with each other. You'll start by exploring collision volumes and understanding the differences between simple and complex collisions. Next, you'll learn about collision events and how to configure them to generate specific responses, such as triggering damage. Through practical tutorials, you'll apply this knowledge to create a damage system and interactive collectible items, enhancing the interactivity and depth of your game.",
                    "In this module, we will explore the powerful tools provided by Unreal Engine's UMG system to create engaging and interactive user interfaces. You'll start with the basics of UMG, learning how to build and structure menus and HUDs using various panels and widgets. We will cover essential widget properties and customization options, enabling you to create visually appealing and functional interfaces. Through a series of tutorials, you'll apply this knowledge to build HUDs that display health and collected items, add effects for player actions, and design essential game screens like pause menus and victory screens, elevating the overall user experience.",
                    "In this module, we will explore the use of audio in Unreal Engine, focusing on how to create and implement immersive soundscapes within your game. You'll start by learning about Sound Waves, AmbientSound actors, and their properties, which are essential for managing audio playback. Next, we'll dive into Sound Cues, exploring how to use nodes to control and manipulate sound. We'll also cover audio attenuation to add depth and realism to your sound design. Through practical tutorials, you'll learn to import, convert, and integrate audio into your game, bringing your virtual world to life with rich soundscapes and dynamic audio effects.",
                    "In this module, we will cover various additional topics that are essential for expanding and finalizing your Unreal Engine projects. You'll learn how to download content from the Epic Games Marketplace and Quixel Bridge, providing you with a wealth of assets to enhance your game. We will also guide you through the process of importing 3D objects from external sources, broadening the scope of your project's visual elements. Finally, you'll learn how to package and export your game, ensuring it is ready for distribution and can be played outside of the Unreal Editor, culminating in a fully functional demo game."
                ],
                "Modules Duration": [
                    "42 minutes",
                    "1 hour",
                    "2 hours",
                    "1 hour",
                    "1 hour",
                    "1 hour",
                    "1 hour",
                    "43 minutes",
                    "1 hour"
                ],
                "Modules Name": [
                    "Getting Started",
                    "The Level Editor",
                    "Actors",
                    "Blueprints",
                    "Players and Input",
                    "Collisions",
                    "User Interfaces",
                    "Audio",
                    "Additional Topics"
                ],
                "Rating": "No rating",
                "Similarity": 0.6388208866119385,
                "Skills": "User Interface (UI) Design, Event-Driven Programming, User Interface (UI), Content Management, Animations, Software Installation, Augmented and Virtual Reality (AR/VR), Scripting, Virtual Environment, Game Design, Unreal Engine, Video Game Development",
                "Subcategory": "Software Development",
                "Title": "Unreal Engine 5 - The Complete Beginner's Course",
                "Type": "Course"
            },
            {
                "Category": "Information Technology",
                "Description": "This course is part of Managing Google Cloud's Apigee API Platform for Hybrid Cloud Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 0,
                "Institution": "Google Cloud",
                "Level": "Beginner",
                "Modules Description": [
                    "This course teaches you how to upgrade, monitor and troubleshoot Google Cloud's Apigee hybrid API platform.",
                    "This module describes the update and rollback process used in Apigee hybrid.",
                    "This module discusses how Apigee hybrid generates logs, metrics and analytics data that can be used for monitoring purposes."
                ],
                "Modules Duration": [
                    "3 minutes",
                    "24 minutes",
                    "1 hour"
                ],
                "Modules Name": [
                    "Introduction",
                    "Upgrade",
                    "Logging and Monitoring"
                ],
                "Rating": 4.9,
                "Similarity": 0.6322956085205078,
                "Skills": "Kubernetes, System Monitoring, Patch Management, Network Troubleshooting, Release Management, Hybrid Cloud Computing, Configuration Management, Application Performance Management, Google Cloud Platform, Application Deployment, Application Programming Interface (API)",
                "Subcategory": "Cloud Computing",
                "Title": "Upgrading and Monitoring the Apigee Hybrid API Platform",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "C# Unity Scripting for Advanced Game Development. Learn Unity C# scripting to build games, covering AI, mobile integration, and version control.",
                "Duration": "1 - 3 Months",
                "Enrolled": 0,
                "Institution": "Packt",
                "Level": "Intermediate",
                "Modules Description": [
                    "Understand the structure of C# scripts and the Unity environment.\nApply variables, loops, and functions to create basic game mechanics.\nAnalyze the impact of physics and user input on game object behaviors.\nCreate interactive gameplay elements like player controls, object interactions, and scene management using C#.",
                    "Understand object-oriented programming principles and their application in Unity.\nApply intermediate C# scripting techniques to develop reusable game mechanics.\nEvaluate and optimize game scripts for efficiency and reusability.\nCreate a fully functional 2D game using advanced C# techniques in Unity.",
                    "Understand and implement Unity's NavMesh system to create intelligent agents and navigate complex environments.\nDevelop and apply mobile game mechanics using touch inputs, accelerometers, and responsive UI in Unity C#.\nAnalyze and optimize the game development process, improving AI behavior and game performance.\nDesign, build, and publish a complete 3D game, managing version control and deploying on multiple platforms."
                ],
                "Modules Duration": [
                    "9 hours",
                    "9 hours",
                    "11 hours"
                ],
                "Modules Name": [
                    "Introduction to Unity and Basic C# Scripting",
                    "Intermediate C# Scripting: Game Mechanics & Reusable Scripts",
                    "Advanced Unity Scripting, AI, & Complete 3D Game Development"
                ],
                "Rating": "No rating",
                "Similarity": 0.6309936046600342,
                "Skills": "Android (Operating System), Development Environment, Responsive Web Design, Programming Principles, User Interface (UI) Design, GitHub, Virtual Environment",
                "Subcategory": "Mobile and Web Development",
                "Title": "Unity C# Scripting — Complete C# for Unity Game Development",
                "Type": "Specialization"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of C# Programming for Unity Game Development Specialization",
                "Duration": "1 - 3 Months",
                "Enrolled": 18939,
                "Institution": "University of Colorado System",
                "Level": "Intermediate",
                "Modules Description": [
                    "Please read the Supplemental Material reading in Week 1. I've included the material in this module for those learners who might have missed it based on the course and Specialization they were currently enrolled in when the new versions of the courses and the new version of the Specialization went live. There's nothing graded in this module, the materials are just provided here so nobody misses any of the great stuff in the Specialization! Note that the exercise and programming assignment numbers are from a different course and have nothing to do with the exercise and programming assignment numbers listed in the four \"real\" weeks of this course.",
                    "",
                    "",
                    "",
                    ""
                ],
                "Modules Duration": [
                    "10 hours",
                    "9 hours",
                    "9 hours",
                    "4 hours",
                    "16 hours"
                ],
                "Modules Name": [
                    "Exceptions and File IO",
                    "Inheritance and Polymorphism",
                    "Event Handling and Menus",
                    "Feed the Teddies",
                    "Supplemental Material"
                ],
                "Rating": 4.6,
                "Similarity": 0.6271400451660156,
                "Skills": "File Management, Debugging, Computer Programming, UI Components, C# (Programming Language), Event-Driven Programming, Software Design Patterns, Object Oriented Programming (OOP), Data Import/Export, Unity Engine, Video Game Development",
                "Subcategory": "Software Development",
                "Title": "Intermediate Object-Oriented Programming for Unity Games",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "Become proficient with Linux. Learn Linux for LFCA Certification",
                "Duration": "3 - 6 Months",
                "Enrolled": 22522,
                "Institution": "LearnQuest",
                "Level": "Beginner",
                "Modules Description": [
                    "This course is the first of a series that aims to prepare you for a role working as an information technology professional. In this course, you will be introduced to the Linux operating system. You will learn about the licensing model and several Linux distributions. We will go through some services delivered in the Linux operating system. We will conclude this course by looking at how to search and analyze text using command line tools in the operating system.",
                    "In this course, we look at how to manage a system with the Linux operating system installed. The course material is a good for anyone preparing for the Linux Foundation Certified IT Associate (LFCA) exam or just interested in learning more about Linux.",
                    "In this course, we look at security and the Linux operating system. The course material is a good for anyone preparing for the Linux Foundation Certified IT Associate (LFCA) exam or just interested in learning more about Linux. This course is the third course in a series that aims to prepare you for working as an information technology professional. In this course, you will be introduced to ownership, authentication, and authorization.  We will drill into creating security through backups and redundancy.  We concluded by looking at how to secure the perimeter of our network and systems.",
                    "In this course, we look at Cloud, DevOps and the Linux operating system. The course material is a good for anyone preparing for the Linux Foundation Certified IT Associate (LFCA) exam or just interested in learning more about Linux. This course is the fourth course in a series that aims to prepare you for working as an information technology professional."
                ],
                "Modules Duration": [
                    "16 hours",
                    "16 hours",
                    "13 hours",
                    "12 hours"
                ],
                "Modules Name": [
                    "Linux Fundamentals",
                    "Managing Linux Systems",
                    "Securing Linux Systems",
                    "Linux Cloud and DevOps"
                ],
                "Rating": 4.5,
                "Similarity": 0.6248642206192017,
                "Skills": "Intrusion Detection and Prevention, Virtual Private Networks (VPN), Version Control, Virtualization, Command-Line Interface, Linux Administration, System Monitoring, Cloud Computing Architecture, Linux Commands, Linux Servers, Linux, User Accounts",
                "Subcategory": "Software Development",
                "Title": "Learning Linux for LFCA Certification",
                "Type": "Specialization"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of Game Design and Development with Unity Specialization",
                "Duration": "1 - 4 Weeks",
                "Enrolled": 6021,
                "Institution": "Michigan State University",
                "Level": "Intermediate",
                "Modules Description": [
                    "Are you ready to take the next step in your journey into game design and development? In this module, we will introduce the course and kick off your third game project, a 3D Platformer. In the first part of the assignment, follow along with the tutorial videos introduced in this module. In the second part of the project, you will modify the game to make it your own.",
                    "Game making is about 10% inspiration and 90% execution. There's a significant difference between having an idea and beginning to turn that idea into something tangible. People often confuse the phrases \"flushing out\" and \"fleshing out\". Idea generation is about \"flushing out\" an idea. Design Documentation is focused on \"fleshing out\" your game idea or adding flesh to the skeleton of an idea to bring it to life. Idea generation (or ideation) and design documentation are the focus of this module.",
                    "This module is all about the impact of games on business and society. If you want to make a living at making games, it is important for you to understand the business side. And I encourage you, as an aspiring game developers, to ask questions about the social impact and context of your game. As a designer, it is important to think about the impact that your creativity could possibly have on the world.",
                    "In this last module, you will explore some additional resources, as well as do some soul searching on what your next step is related to game design and development. In this module, you will also finish up the 3D Platformer project, submit it for peer review, and peer review your fellow learners games. Finish the course strong!"
                ],
                "Modules Duration": [
                    "6 hours",
                    "3 hours",
                    "2 hours",
                    "3 hours"
                ],
                "Modules Name": [
                    "Your Fourth Step into Game Design and Development",
                    "Fleshing Out a Game Design",
                    "Business and Society",
                    "Expanding Your Knowledge, Soul Searching and Finishing Up"
                ],
                "Rating": 4.7,
                "Similarity": 0.6168642044067383,
                "Skills": "Game Design, Peer Review, Animation and Game Design, Social Studies, Business, Video Game Development, Ideation, Unity Engine, Computer Programming, Software Design, Microsoft Visual Studio, C# (Programming Language)",
                "Subcategory": "Software Development",
                "Title": "Game Design and Development 4: 3D Platformer",
                "Type": "Course"
            },
            {
                "Category": "Computer Science",
                "Description": "This course is part of Unity Android — Build Eight Mobile Games with Unity and C# Specialization",
                "Duration": "1 - 3 Months",
                "Enrolled": 0,
                "Institution": "Packt",
                "Level": "Advanced",
                "Modules Description": [
                    "In this module, we will dive into creating a simple Ball Smash game for Android. You'll be guided through the entire process, from initial setup to final testing, all within a concise 40-minute timeframe.",
                    "In this module, we will explore the creation of a 3D endless runner hyper-casual game. You'll learn everything from setting up the game environment and adding players to creating enemies, score systems, and user interfaces.",
                    "In this module, we will focus on building a simple Android game within an hour. This hands-on experience will cover the essential steps, ensuring you can develop a functional and engaging game quickly.",
                    "In this module, we will guide you through the development of a 3D Tappy Ball game. You'll learn how to set up the player, create and animate obstacles, and ensure smooth gameplay by managing spawning mechanics.",
                    "In this module, we will cover the implementation of video ads in your games. You'll learn how to set up Unity ads, incorporate rewarded video ads, and effectively monetize your game through strategic ad placements.",
                    "In this module, we will delve into the basics of Unity Android game development. You'll explore touch inputs, object interaction using RayCasting, and creating user interfaces that adapt to different screen sizes."
                ],
                "Modules Duration": [
                    "1 hour",
                    "2 hours",
                    "1 hour",
                    "1 hour",
                    "58 minutes",
                    "3 hours"
                ],
                "Modules Name": [
                    "Game 5 - Ball Smash Android Game",
                    "Game 6 - Build a 3D Endless Runner Hyper-Casual Game",
                    "Game 7 - Build a Simple Android Game in 1 Hour",
                    "Game 8 - 3D Tappy Ball Game",
                    "Implement Video Ads in Your Games",
                    "Unity Android Game Development Basics"
                ],
                "Rating": "No rating",
                "Similarity": 0.6161752939224243,
                "Skills": "C# (Programming Language), Scripting, Mobile Development, Android Development, Animations, User Interface (UI) Design, Game Design, Video Game Development, Unity Engine, User Interface (UI)",
                "Subcategory": "Mobile and Web Development",
                "Title": "Advanced Game Development and Unity Basics",
                "Type": "Course"
            }
        ]
    }
]